var answer = 
[
'지속 가능한 경영 강화를 위해 2030 중장기 전략의 일환의 ESG 상세 적용 전략 체계입니다. <br/>\
환경, 경제, 사회적 가치를 지향점으로 두어 <br/>\
디지털 기반 탄소 중립 실현의 환경 측면, <br/>\
산업 현장 안전 지원의 사회 측면,
ESG 평가 대비 지배구조 측면으로 각각의 추진 전략이 내포 되어있습니다.\
',

'연료비 조정 단가란 석유, 석탄, 액화천연가스 등 전력 생산에 소요되는 연료 구입비를 반영해 전기 요금에 적용하는 항목을 말합니다. <br/>\
최근 코로나 19 이슈, 우크라이나 전쟁으로 인해 연료 구입비가 폭등하고 있지만, 서민 경제와 인플레이션을 고려하여 아직 까진 연료비 조정 단가를 동결한 상황입니다.\
',

'기후 환경요금은 기존 전력량요금에 포함되어 있는 <br/>\
깨끗하고 안전한 에너지를 위해 소요되는 기환경비용을 별도로 구분하여 <br/>\
표기,청구함으로써 해당 비용에 대한 투명성을 제고하기 위한 요금제도 입니다. <br/>\
관련 이슈론 지난 12월 기후환경요금을 4월에 올리겠다고 공표한 바 있습니다만, <br/>\
새 정부 출범으로 전기요금 백지화에 대한 공약으로 인해 재논의가 필요한 상황입니다.\
',

'전기 생산에 쓰이는 연료비 변동분을 전기요금에 주기적으로 반영하는 제도를 말합니다. <br/>\
전기요금의 원가를 결정하는 요소 중 큰 비중을 차지하는 연료 구매 비용을 반영하려는 취지로 도입됩니다. \
',

'결론부터 말씀드리자면 전기요금은 올려야 합니다. <br/>\
개인적인 생각으로 전기요금과 지난 2년간 실시해온 사회적 거리두기는 큰 맥락이 같습니다. <br/>\
국민들의 고통을 수용할 수 있는 기간을 두어 분산시키자는 맥락입니다. <br/>\
에너지 원가 상승과 기후 환경 정책등으로 요금 상승이 불가피한 가운데 현재 한전의 적자는 5조원을 넘어 올해 20조원 적자를 기록한 예측 기사를 보았습니다. <br/>\
한전의 적자는 결국 국민의 혈세로 메울수 밖에 없는 상황으로 향하기에 마냥 전기요금을 동결할 수 만은 없는 노릇이라 생각합니다. <br/>\
따라서, 전기요금의 점진적 상승에 따른 사회적 합의와 공감이 필요하다고 생각합니다.\
',

'2009년 12월 27일 한전과 아랍에미리트 원자력공사간 성사된 186억 달러 규모의 원전 프로젝트 입니다.<br/>\
계약 이후 성공적인 준공과 함께 1,2호기 건설을 추가로 허가받아 성공적으로 수행한 프로젝트 입니다.\
',

'4차 산업 혁명의 주역이 되고자 국가 기술자격 분야의 최고 자격인 정보관리 기술사에 도전하였습니다. <br/>\
다른 수험생들보다 일찍 도전한 덕분에 기술사 자격을 갖고 신입사원으로 지원하게 됐습니다. <br/>\
기술사적 사고를 겸비한 젊은 신입사원과 한국전력공사의 사업의 규모와 방향성 조합이라면, <br/>\
개인과 회사가 동반 성장하는데, 큰 도움이 되리라 생각됩니다.\
',

'Github에 Web Hosting 기능이 있습니다. Java Script를 이용하여 소스코드를 작성하고 이를 호스팅 했습니다. <br/>\
위 서비스를 활용하여 구축 비용 없이 저만의 암기장을 만들 수 있었습니다.\
',

'IaaS, PaaS, SaaS 는 클라우드 서비스 유형을 말하고, 이는 제공되는 자원의 범위에 따라 나뉩니다. <br/>\
먼저 IaaS 는 인프라를 PaaS는 개발환경을 SaaS 소프트웨어 자체를 클라우드 환경에서 제공하는 것을 말합니다. \
',

'ISP 기획은 Information Stragety Planning의 약자로 중장기 정보화 기획을 말합니다. <br/>\
이는 조직에 정보화 사업을 중장기적으로 어떻게 수행할지 청사진을 그립니다. <br/>\
전체적인 컨셉은 EA에서 그린 그림을 ISP에서 세분화 하고, 이를 ISMP를 통해 상세화 시킵니다. \
',

'기술사 취득 후 같이 학습했던 기술사님들끼리 모여 집필활동을 하고 있습니다. <br/>\
1월 말부터 시작해서, 2주에 한번 Zoom을 통해 Meeting 을 하여 현재 출판사에 기획안을 투고했고, 검토중입니다. <br/>\
책 주제는 IT 기술을 쉽게 풀어 설명해주는 컨셉의 책입니다. <br/>\
이를 통해 협업과 가치창출 그리고 전문지식에 대한 사회공헌을 하고 있다 생각들어 기쁩니다.\
',

'PaaS-TA 란 오픈 소스 기반의 클라우드 서비스 개발 환경과 통합 모니터링 환경등이 추가된 국산 개방형 클라우드 플랫폼입니다. \
',

'클라우드 개론, Virtual Machine 설치, PaaS-TA 기반 서비스 제어를 했습니다. <br/>\
가상 머신 기반의 정형화된 개발 플랫폼 설치 방법을 익힐 수 있었습니다. <br/>\
기존 가상머신에 비해 PaaS-TA 플랫폼에서 제공하는 기능들이 굉장히 직관적인게 인상깊었습니다.\
',

'전반적인 인공지능에 대한 학습, Python과 관련 라이브러리 사용법, AWS 환경 기반 구축 방법을 학습했습니다. <br/>\
인공지능에 대한 학습 과정중 기술적인 교육 이외에 인공지능 윤리와 같은 교육이 포함되어 있어 인상 깊었습니다.\
',

'Numpy, Matplotlib, Pandas는 모두 인공지능 및 빅데이터를 위한 Python Library입니다. <br/>\
Numpy는 주로 행렬이나 대규모 다차원 배열 연산을, Matplotlib는 수학적 확장 연산을, Pandas는 Bigdata 시각화를 도와주는 Library입니다.\
',

'ESS 는 Energy Storage System으로, 저장이 어렵고 사용 후 없어져버리는 에너지를 효율적으로 사용할 수 있도록 저장,관리하는 시스템입니다. <br/>\
ESS 종류론 주택용 ESS와 상업용 ESS가 있습니다.\
',

'스마트 그리드는 국가나 도, 주 단위의 광역지역을 위한 지능형 전력망을 뜻하고, (AMI, 송,배전 인프라)<br/>\
마이크로 그리드는 독립된 분산전원을 중심으로 한 국소적인 전력 공급 시스템을 말합니다. (EMS, ESS)\
',

'조직활동 중 다양한 이해관계자가 이해하는 수준이 다른 것이 다소 힘들었습니다. <br/>\
병원 전산실에서 근무할 당시, 개발자의 언어와 임상의 언어가 달라 의사소통이 힘들었습니다. <br/>\
이를 극복하기 위해 용어 사전을 정의하여 접점이 생갈만한 용어를 정리하니 훨씬 수월하게 업무에 임할 수 있었습니다. <br/><br/>\
의학용어 정리 // 정형, 비정형 데이터 정리 \
',

'병원 전산실 근무 당시 업무처리순서에 대해 C Level 과의 갈등이 있었습니다. <br/>\
갈등의 원인은 저는 전산실 입장을 고집하고, C Level분은 병원 전체를 고려한 제안이었습니다. <br/>\
',
];