var question = question.concat(
'비상방송설비',
'지능형 홈 네트워크',
);

var answer = answer.concat(
// 비상방송설비
'# 정의 (비상방송설비의 화재안전성능기준 NFPC202) <br/>\
- 비상방송설비는 비상상황이나 재해 등 비상시에 대중에게 빠르게 정보를 제공하고 안전을 유지하기 위한 설비 <br/><br/>\
# 종류<br/>\
- 확성기 <br/>\
- 음량조절기 <br/>\
- 증폭기 <br/><br/>\
# 단락(합성)시 문제점, 해결방안 <br/>\
1. 문제점<br/>\
- 방송수신 중단 <br/><br>\
2. 해결방안 <br/>\
- 관리적 : 정기적인 점검, 유지보수 <br/>\
- 기술적 : 백업 시스템 구축, 기능추가(자가진단, 표시) <br/><br/>\
* 129회 통신 1교시 1번\
',
  
// 지능형 홈 네트워크
'# 정의 (지능형 홈네트워크 설비 설치 및 기술기준) <br/>\
- 주택의 성능과 주거의 질 향상을 위하여 세대 또는 주택단지 내 지능형 정보통신 및 가전기기 등의 상호 연계를 통하여 통합된 주거서비스를 제공하는 설비 <br/><br/>\
# 필수설비 (망장기) <br/>\
- 망 : 단지망, 세대망 <br/>\
- 장비 : 홈게이트웨이, 세대단말기, 단지네트워크장비, 단지서버 <br/>\
- 기기 : 원격제어기기, 원격검침시스템, 감지기, 전자출입시스템, 무인택배시스템 <br/><br/>\
* 129회 통신 1교시 2번
',
);
