var answer = 
[
'지속 가능한 경영 강화를 위해 2030 중장기 전략의 일환의 ESG 상세 적용 전략 체계입니다. <br/>\
환경, 경제, 사회적 가치를 지향점으로 두어 <br/>\
디지털 기반 탄소 중립 실현의 환경 측면, <br/>\
산업 현장 안전 지원의 사회 측면, <br/>\
ESG 평가 대비 지배구조 측면으로 각각의 추진 전략이 내포 되어있습니다.\
',

'연료비 조정 단가란 석유, 석탄, 액화천연가스 등 전력 생산에 소요되는 연료 구입비를 반영해 전기 요금에 적용하는 항목을 말합니다. <br/>\
최근 코로나 19 이슈, 우크라이나 전쟁으로 인해 연료 구입비가 폭등하고 있지만, 서민 경제와 인플레이션을 고려하여 아직 까진 연료비 조정 단가를 동결한 상황입니다.\
',

'기후 환경요금은 기존 전력량요금에 포함되어 있는 <br/>\
깨끗하고 안전한 에너지를 위해 소요되는 기환경비용을 별도로 구분하여 <br/>\
표기,청구함으로써 해당 비용에 대한 투명성을 제고하기 위한 요금제도 입니다. <br/>\
관련 이슈론 지난 12월 기후환경요금을 4월에 올리겠다고 공표한 바 있습니다만, <br/>\
새 정부 출범으로 전기요금 백지화에 대한 공약으로 인해 재논의가 필요한 상황입니다.\
',

'전기 생산에 쓰이는 연료비 변동분을 전기요금에 주기적으로 반영하는 제도를 말합니다. <br/>\
전기요금의 원가를 결정하는 요소 중 큰 비중을 차지하는 연료 구매 비용을 반영하려는 취지로 도입됩니다. \
',

'결론부터 말씀드리자면 전기요금은 올려야 합니다. <br/>\
개인적인 생각으로 전기요금과 지난 2년간 실시해온 사회적 거리두기는 큰 맥락이 같습니다. <br/>\
국민들의 고통을 수용할 수 있는 기간을 두어 분산시키자는 맥락입니다. <br/>\
에너지 원가 상승과 기후 환경 정책등으로 요금 상승이 불가피한 가운데 현재 한전의 적자는 5조원을 넘어 올해 20조원 적자를 기록한 예측 기사를 보았습니다. <br/>\
한전의 적자는 결국 국민의 혈세로 메울수 밖에 없는 상황으로 향하기에 마냥 전기요금을 동결할 수 만은 없는 노릇이라 생각합니다. <br/>\
따라서, 전기요금의 점진적 상승에 따른 사회적 합의와 공감이 필요하다고 생각합니다.\
',

'2009년 12월 27일 한전과 아랍에미리트 원자력공사간 성사된 186억 달러 규모의 원전 프로젝트 입니다.<br/>\
계약 이후 성공적인 준공과 함께 1,2호기 건설을 추가로 허가받아 성공적으로 수행한 프로젝트 입니다.\
',

'4차 산업 혁명의 주역이 되고자 국가 기술자격 분야의 최고 자격인 정보관리 기술사에 도전하였습니다. <br/>\
다른 수험생들보다 일찍 도전한 덕분에 기술사 자격을 갖고 신입사원으로 지원하게 됐습니다. <br/>\
기술사적 사고를 겸비한 젊은 신입사원과 한국전력공사의 사업의 규모와 방향성 조합이라면, <br/>\
개인과 회사가 동반 성장하는데, 큰 도움이 되리라 생각됩니다.\
',

'Github에 Web Hosting 기능이 있습니다. Java Script를 이용하여 소스코드를 작성하고 이를 호스팅 했습니다. <br/>\
위 서비스를 활용하여 구축 비용 없이 저만의 암기장을 만들 수 있었습니다.\
',

'IaaS, PaaS, SaaS 는 클라우드 서비스 유형을 말하고, 이는 제공되는 자원의 범위에 따라 나뉩니다. <br/>\
먼저 IaaS 는 인프라를 PaaS는 개발환경을 SaaS 소프트웨어 자체를 클라우드 환경에서 제공하는 것을 말합니다. \
',

'ISP 기획은 Information Stragety Planning의 약자로 중장기 정보화 기획을 말합니다. <br/>\
이는 조직에 정보화 사업을 중장기적으로 어떻게 수행할지 청사진을 그립니다. <br/>\
전체적인 컨셉은 EA에서 그린 그림을 ISP에서 세분화 하고, 이를 ISMP를 통해 상세화 시킵니다. \
',

'기술사 취득 후 같이 학습했던 기술사님들끼리 모여 집필활동을 하고 있습니다. <br/>\
1월 말부터 시작해서, 2주에 한번 Zoom을 통해 Meeting 을 하여 현재 출판사에 기획안을 투고했고, 검토중입니다. <br/>\
책 주제는 IT 기술을 쉽게 풀어 설명해주는 컨셉의 책입니다. <br/>\
이를 통해 협업과 가치창출 그리고 전문지식에 대한 사회공헌을 하고 있다 생각들어 기쁩니다.\
',

'PaaS-TA 란 오픈 소스 기반의 클라우드 서비스 개발 환경과 통합 모니터링 환경등이 추가된 국산 개방형 클라우드 플랫폼입니다. \
',

'클라우드 개론, Virtual Machine 설치, PaaS-TA 기반 서비스 제어를 했습니다. <br/>\
가상 머신 기반의 정형화된 개발 플랫폼 설치 방법을 익힐 수 있었습니다. <br/>\
기존 가상머신에 비해 PaaS-TA 플랫폼에서 제공하는 기능들이 굉장히 직관적인게 인상깊었습니다.\
',

'전반적인 인공지능에 대한 학습, Python과 관련 라이브러리 사용법, AWS 환경 기반 구축 방법을 학습했습니다. <br/>\
인공지능에 대한 학습 과정중 기술적인 교육 이외에 인공지능 윤리와 같은 교육이 포함되어 있어 인상 깊었습니다.\
',

'Numpy, Matplotlib, Pandas는 모두 인공지능 및 빅데이터를 위한 Python Library입니다. <br/>\
Numpy는 주로 행렬이나 대규모 다차원 배열 연산을, Matplotlib는 수학적 확장 연산을, Pandas는 Bigdata 시각화를 도와주는 Library입니다.\
',

'ESS 는 Energy Storage System으로, 저장이 어렵고 사용 후 없어져버리는 에너지를 효율적으로 사용할 수 있도록 저장,관리하는 시스템입니다. <br/>\
ESS 종류론 주택용 ESS와 상업용 ESS가 있습니다.\
',

'스마트 그리드는 국가나 도, 주 단위의 광역지역을 위한 지능형 전력망을 뜻하고, (AMI, 송,배전 인프라)<br/>\
마이크로 그리드는 독립된 분산전원을 중심으로 한 국소적인 전력 공급 시스템을 말합니다. (EMS, ESS)\
',

'조직활동 중 다양한 이해관계자가 이해하는 수준이 다른 것이 다소 힘들었습니다. <br/>\
병원 전산실에서 근무할 당시, 개발자의 언어와 임상의 언어가 달라 의사소통이 힘들었습니다. <br/>\
이를 극복하기 위해 용어 사전을 정의하여 접점이 생갈만한 용어를 정리하니 훨씬 수월하게 업무에 임할 수 있었습니다. <br/><br/>\
의학용어 정리 // 정형, 비정형 데이터 정리 \
',

'병원 전산실 근무 당시 업무처리순서에 대해 C Level 과의 갈등이 있었습니다. <br/>\
갈등의 원인은 저는 전산실 입장을 고집하고, C Level분은 병원 전체를 고려한 제안이었습니다. <br/>\
',

'저의 차별화된 장점 2가지를 말씀 드리겠습니다. <br/>\
먼저 경력측면의 장점입니다. <br/>\
요즘 MZ세대는 한 직장에 오랫동안 머무르지 않아 기업 입장에서 어려움을 겪고 있다고 합니다. <br/>\
이에 반면 저는 한 직장에서 7년동안 근무한 경력이 있습니다. <br/>\
같은 MZ세대지만 장점은 겸비하고 단점은 해결이 된 인재라고 감히 말씀드리겠습니다. <br/><br/>\
다음으로 자격측면의 장점입니다. <br/>\
저는 정보관리 기술사 자격을 갖고 있습니다. <br/>\
이는 다른 면접자들에 비해 한 층 높은 기술적인 안목을 갖고 있다고 말씀드릴 수 있습니다. <br/>\
폭넓은 기술에 대한 이해와 사고능력은 업무의 적응과 더불어 사업수행에 큰 강점이라고 생각합니다.\
',

'지속가능한 기술분야의 전문가로써 성장하기 위해 지원했습니다.<br/>\
최근 전세계를 강타하는 이슈중 하나는 바로 탄소 중립이라고 생각됩니다. <br/>\
인간의 욕심으로 인해 생긴 환경적인 문제를 해결하기 위해 ICT 기술이 큰 역할을 할것이라는 기고문을 보고 감명받았습니다. <br/><br/>\
현재 한국전력의 경우 기존 에너지 기술을 넘어 디지털 에너지 기술로 나아가며, 시장을 선도하고 있습니다. <br/>\
이로 인해 생산의 효율화, 소비의 예측화 나아가 탄소중립의 현실화를 이루는<br/>\
한국전력공사가 가장 적합하다고 판단되어 입사를 결심했습니다.\
',

'저의 장점은 주어진 가치에 안주하지 않는 점입니다. <br/>\
개발자로 근무했을 당시, 표면적으로 잘 운영되는 프로그램이 있었지만, 효율적인 메모리 관리가 되지 않은 점을 문제 삼았습니다. <br/>\
메모리를 좀 더 효율적으로 관리하기 위해 소스코드를 Refactoring 자주하는 습관으로 업무에 임했습니다. <br/>\
이는 앞으로 주어질 업무에도 동일하게 적용될 것으로 생각됩니다. <br/><br/>\
단점은 반복된 업무에 쉽게 염증을 낸다는 것입니다. <br/>\
전산실 근무중 이를 해결하기 위해 자동화할 수 있는 것은 최대한 자동화를 시키기 위해 <br/>\
Window Batch File, Linux Shell Script를 학습하여 휴먼에러를 최소화 시킬 수 있었습니다. \
',

'PLC 통신은 Programmable Logic Controller 통신으로 산업의 유지 관리 및 자동제어 모니터링에 사용되는 제어장치를 위한 통신입니다.\
',

'현재 한국전력공사의 주요 사업은 국내 사업과 해외 사업 그리고 에너지 신사업으로 나눌 수 있습니다. <br/>\
먼저 국내 사업입니다. 국내 사업엔 송배전, 전력판매, 수요 관리등 주로 전력 공급에 대한 기초 사업입니다. <br/>\
다음으로 해외 사업입니다. 해외 사업엔 전력 공급에 대한 기초 사업을 해외를 대상으로 하는 사업입니다. 2009년엔 한국형 원전을 UAE로 수출하는 성과를 낸 이력이 있습니다. <br/>\
마지막으로 에너지 신사업입니다. 전기차, 태양광, 스마트시티, 그린 수소등 주로 탄소 중립을 위한 신사업이 포진되어 있습니다.\
',

'AMI란 Advanced Metering Infrastructure로 지능형 원격 검침 장치입니다. <br/>\
주요 기능은 에너지 사용량 모니터링, 인공지능을 활용한 부하 예측등이 있고, 최근엔 이를 위해 삼성전자와 MOA를 체결한 이력이 있습니다. <br/>\
또한 한전의 그룹사인 한전KDN에선 최근 효율적인 AMI관리를 위한 AMI 장애 진단 시스템을 개발한 이력이 있씁니다.\
',

'네트워크 토폴로지란 네트워크 요소들인 링크와 노드 등의 물리적, 논리적 연결을 뜻합니다. <br/>\
대표적인 토폴로지는 Star형, Bus형, Mesh형 등이 있습니다.\
',

'수요반응인 DR은 Demand Response의 약자로, 현재 전력량의 수요에 맞추기 위해 전기 사용자가 사용량을 변화시키는 것을 말합니다. <br/>\
이는 전력을 생산하는 공급측면의 기회비용이 많이 들어가, 역발상으로 공급자의 수요를 반응시키는 것을 의미합니다. <br/>\
종류론 가격 기반의 DR과 인센티브 기반의 DR 이 있습니다. <br/>\
기술요소론 인프라 측면의 AMI, Network 기술 / 서비스 측면에선 OpenADR, SEP 등과 같은 에너지 관리 시스템이 있습니다.\
',

'MOU(Memorandum of Understanding) : 교섭된 내용을 확인·확인하기 위해 정식 계약 체결에 앞서 문서로된 합의인 양해 각서 <br/>\
MOA(Memorandum of Agreement) : MOU 체결 후 이에 대한 사항을 구체적으로 명시화하여 계약한 합의 각서\
',

'Clean Energy, Smart KEPCO 입니다. <br/>\
엄정한 윤리의식을 바탕으로 깨끗하고 효율적인 에너지를 공급하며 디지털 변환을 기반으로 더 나은 에너지 세상을 구현하는 한전입니다.\
',

'TCP나 UDP에서 상호통신을 위해 미리 정해놓은 Port를 말합니다. 전체 범위는 16bit를 사용한 주소범위 이고, 이중 자주 사용하는 Port를 10bit 이내 범위로 정의 해놓은 것이 Well known port입니다. 대표적인 Port 번호는 HTTP 80 port, Telnlet 23 Port 등이 있습니다.\
',

'우선 CSMA 는 Carrier Sense Multiple Access로 동시에 네트워크를 사용할 때, 상호충돌 방지 기능입니다. <br/>\
개념 비교입니다. CSMA CA는 충돌 회피 방식이고, CSMA CD 는 매체 점유 방식입니다. <br/>\
특징 비교 입니다. CSMA CA는 ACK 프레임을 사용하여 통신하고, CSMA CD는 Carrier Sense, Multile Access, Collision Detection을 활용합니다. <br/>\
다음으로 사례 비교입니다. CSMA CA는 주로 무선 LAN에서 사용하고, CSMA CD는 주로 유선 환경에서 사용합니다.\
',

'광케이블은 빛을 이용해 정보를 전송하는 전송매체입니다. <br/>\
장점은 외부 잡음에 강하고, 광대역이고, 보안성이 좋습니다. <br/>\
단점은 물리적인 내성이 약한점이 단점입니다.\
',

'서브넷 마스크는 네트워크 영역과 호스트 영역을 구별하기 위한 마스킹 비트입니다. <br/>\
서브네팅은 할당받은 IP 주소에 서브넷 마스크를 이용하여 새로운 대역을 생성하는 방법입니다. <br/>\
VLSM은 다양한 길이의 서브넷 마스크를 사용하는 것을 의미하며 서브네팅으로 한 번 나눈 IP를 한 번 더 쪼개는 방법입니다.\
',

'PSTN은 공중전화통신망으로, 과거로부터 사용되던 일반 공중용 아날로그 전화망을 의미합니다. <br/>\
ISDN은 정합동신통신망으로, 디지털 통신망을 이용하여 음성,문자,영상 등의 통신을 종합적으로 할 수 있도록 하는 통신서비스입니다.\
',

'TRS 는 Trunked Radio Service로, 주파수를 다수의 이용자가 공동으로 사용하는 방식을 말합니다. <br/>\
여러개 주파수 중 빈 채널을 자동으로 선택, 통화하게 되므로 연결이 쉽고 외부로부터 혼선이 없으며 통화 누설이 없어 보안성이 우수합니다.\
',

'Pulse Code Modulation으로 펄스 부호 변조입니다. 디지털 신호를 디지털 신호로 변환하는 통신 방식입니다. <br/>\
PCM 이외 펄스의 폭을 조절하는 방식으로 변조하는 PWM이 존재합니다.\
',

'ASK, PSK, FSK는 먼저, 아날로그 신호를 디지털 신호로 변조하는 기술들입니다. 이들은 반송파를 어떻게 변조하느냐에 따라 구분됩니다. <br/>\
ASK 는 진폭에 의한 변조, PSK는 위상에 의한 변조, FSK 는 주파수에 의한 변조를 나타냅니다. <br/>\
보통 잡음과 내성에 강한 FSK나 PSK를 사용합니다.\
',

'ESS는 Eneregy Storage System으로 원하는 시간에 전력을 생산하기 어려운 태양광, 풍력등 신재생 에너지를 미리 저장했다가 필요한 시간대에 사용할 수 있게 해주는 에너지 저장 시스템 기술을 말합니다. <br/>\
이는 전기를 생산하는 발전 영역, 생성하는 송배전 영역 그리고 전기를 수용하는 수용가 영역에 모두 적용되는 광범위한 기술입니다.\
',

'마이크로 그리드는 기존 전력망에 정보기술(IT)을 접목해 에너지 효율을 최적화한 차세대 지능형 전력망인 스마트 그리드를 소지역 특성에 맞게 적용한 것입니다. <br/>\
주요 기술요소론 에너지 저장 장치인 ESS와 이를 지능형 관리하기 위한 ESM이 있습니다. <br/>\
산업통상자원부의 로드맵상 전력공급이 어려운 섬 지역같은 곳들의 에너지 공급 체계를 마이크로그리드를 활용한 에너지 자립섬으로 발전시키겠다는 계획을 갖고 있씁니다.\
',

'단체의 직원만 접근이 가능한 사설망을 말합니다. 주로 폐쇄망을 사용하지만, 코로나19로 인해 재택근무 횟수가 많아진 요즘은 VPN을 활용하여 인트라넷 접근을 허용하는 기술들을 적용하고 있습니다.\
',

'크게 디지털 변전소와 한전 데이터 사이언스 연구소가 있습니다. <br/>\
디지털 변전소는 AI 기반 예측 관리 등을 통해 효율적인 변전소를 운영하는 기술입니다. <br/>\
데이터 사이언스 연구소는 한전의 기존 데이터를 기반으로 AI, DL등을 연구하는 연구소를 말합니다. <br/>\
최근 성과로는 광주광역시에서 실시한 1인가정 살핌 서비스, 딥러닝 기반 얼굴인식 기술, 태양광 발전량 예측 기술이 있습니다.\
',

'4계층 네트워크 가상화 기술입니다. 기존 전용회선을 가상화한 기술이며, 장점으론 구축비용이 저렴하다는 점이 존재하며, 단점으론 보안이 취약하다는 점입니다. 최근 코로나19와 공공기관 지역 이전으로 인해 원격지 개발, 재택근무등이 증가하면서 VPN 수요가 증가하고 있는 상황입니다.\
',

'방화벽이란 미리 정의된 보안 규칙에 기반한 네트워크 트래픽을 모니터링하고 제어하는 네트워크 보안 시스템입니다. <br/>\
구현 방법에 따라 소프트웨어 방화벽과 하드웨어 방화벽으로 구분됩니다.\
',

'패킷 별로 제어 하여 허용 혹은 거부하는 필터링 기능을 의미합니다. <br/>\
브릿지나 스위치 그리고 방화벽 단에서 기능을 제공합니다.\
',

'Programmable Logic Controller 라는 뜻으로 산업 플렌트의 유지관리 및 자동 제어 및 모니터링에 사용하는 제어 장치입니다.\
',

'푸리에 변환은 시간에 대한 함수를 주파수 섭운으로 분해하는 변환입니다. 이는 주파수 성분을 분해 함으로써 변조된 신호를 해석하는데 사용되는 기초 이론입니다. \
',

'소스코딩, 채널코딩, 라인 코딩은 모두 샤논의 통신 계통도에 정보의 부호화 복호화 과정중 필요한 개념입니다. <br/>\
먼저 소스코딩은 압축 부호화 연산이고, 채널 코딩은 데이터 에러 제어를 위해 잉여 비트를 추가하는 오류 정정 기법이고, 라인 코딩은 저장 매체에 기록 될 수 있또록 디지털 데이터를 나타내는데 사용되는 전압 또는 전류를 말합니다.\
',

'Data Base명령어를 뜻합니다. <br/>\
DDL은 Definition, DML은 Management, DCL은 Control 기능을 수행합니다. <br/>\
DDL은 CREATE, ALTER // DML은 SELECT, UPDATE // DCL은 GRANT REVOKE 등이 있습니다.\
',

'직교 주파수 분할 다중 방식은 다중 반송파를 이용하여 디지털 데이터를 인코딩하는 방식입니다. <br/>\
인터넷 접속, 무선 네트워크, 4세대 이동 통신등에서 활용됩니다.\
',

'NAT는 IP 패킷의 TCP/UDP 포트 숫자와 소스 및 목적지의 IP 주소등을 재기록하면서 라우터를 통해 네트워크 트래픽을 주고 받는 기술을 말합니다. <br/>\
NAT를 쓰는 이유는 하나의 공인IP 주소를 공유하여 사용하기 위해 사용됩니다.\
',

'개념은 SW 시장의 속도가 빨라짐에 따라 적합한 개발 방법론입니다. <br/>\
특징은 개인과 상호작용, 변화에 대응, 동작하는 소프트웨어, 고객과 협력이 있습니다. <br/>\
사례는 Scrum, XP, Kanban 등이 있습니다.\
',

'요구사항 분석은 소프트웨어가 무엇을 해야하는가를 추적하여 명세하는 작업을 의미합니다. <br/>\
절차론 먼저 서면으로 요구사항에 대해 주고받고, 이후 유선상 혹은 대면으로 요구사항을 수용합니다. <br/>\
요즘 코로나 19로 인해 대면 요구사항에 대한 최소화 움직임이 있지만, 결국 소프트웨어 개발은 사람대 사람의 작업인지라 효율적인 요구사항 분석을 위해선 불가피한 부분이 분명히 존재함을 실무에서 느꼈습니다.\
',

'객체지향의 특징은 캡슐화, 추상화, 다형성, 상속이 있습니다. <br/>\
먼저 캡슐화는 SW 공학에서 변경에 대처하는 고전적인 설계 원리로 높은 응집도와 낮은 결합도 기반으로 이루어 집니다. 이를 위해 접근 한정자로 멤버 변수나 함수를 정의 합니다. <br/>\
추상화는 객체지향을 이루고 있는 요소들의 속성이나 행동을 추출하여 정의하는 개념을 말합니다. 이는 추상클래스를 기반으로 구현 합니다. <br/>\
다음으로 다형성은 서로다른 클래스의 객체가 각기 다른 방식으로 동작하는 원리를 말하며, 오버로딩과 오버라이딩으로 구현 합니다. <br/>\
마지막으로 상속은 클래스의 멤버 변수나 메소드를 하위 클래스에서 사용할 수 있는 기능을 말합니다. 클래스 상속을 통해 구현합니다. \
',

'추상 클래스는 추상 메소드 기반 미완성된 설계도라면, 인터페이스는 추상 클래스와 비슷하지만, 기본 설계도의 특성을 띄고 있음에 차이가 존재합니다. <br/>\
특징 차이점은 추상 클래스는 자식 클래스에서 용도를 완성하고, 인터페이스는 각기 기능의 최소 단위를 나타냅니다. 따라서 인터페이스는 다중 상속이 가능합니다. <br/>\
호출 차이점은 추상 클래스는 abstract로 정의, extends로 상속을 받고, 인터페이스는 interface로 정의, implements로 구현합니다. <br/>\
대표적인 예제론 추상 클래스를 활용하여 동물들을 정의하고, 각기 속성을 인터페이스로 상속하는 예제가 있습니다.\
',

'2020년 까지 탄소 배출 30%절감을 위한 한국전력에서 수행하는 ESG 전략체계입니다. <br/>\
환경 측면으론 친환경 에너지 구현, 사회측면으론 사람중심 일터지향, 지배구조 측면으론 ESG 경영을 위한 담당 조직을 운영하고 있습니다.\
',

'환경측면에선 에너지 신사업 기반 수입 창출 // 사회 측면에선 지역상생발전 및 지역사회 신뢰 구축 // 지배구조 측면에선 윤리경영 및 반부패 체계 강화 등이 있습니다.\
',

'여러가지 평가 기관중 2021년 기준, 한국기업지배구조원의 평가 결과 환경 B+, 사회 A, 지배구조 B+로 종합등급 B+ 등급을 유지하고 있습니다.\
',

'환경 측면에선 디지털 기반 탄소 중립 구현, 사회 측면에선 산업현장 안전 지원, 지배구조 축면에선 ESG 평가 대비를 위한 업무 효율성 지원등이 존재합니다.\
',

'이사회 직속 ESG 위원회와 ESG 자문 위원회가 있고, 기획처 직속 ESG TF가 있습니다.\
',

'총 경제, 환경, 사회, 인간 4가지 강령이 존재합니다. <br/>\
경제 지속 성장, 환경 가치 창출, 사회 신뢰 구축, 인간 존중 경영 실천이 있습니다.\
',

'하향식 설계 방법은 시스템 구조도의 위층에 있는 모듈부터 통합하는 방법이고, 상향식 설계 방법은 최하위 모듈 부터 통합하는 방법입니다. <br/>\
구현 대상으론 하향식 설계 방법은 테스트 스텁을 다루고, 상향식 설계 방법은 테스트 드라이브를 다룹니다. <br/>\
특징으론 하향식은 드라이버에 비해 스텁이 쉽게 작성할 수 있는 것이 특징이고, 상향식은 하위층 중요한 기능의 모듈이 많은 경우 두각을 드러냅니다. 이외 특수하고 중요한 기능을 먼저 개발하는 연쇄식이 있습니다.\
',

'UML은 객체 지향 시스템을 개발할 때 산출물을 명세화, 시각화, 문서화하는데 쓰이는 언어입니다. <br/>\
UML 버전 2.0을 주로 사용하고 있으며, 구조 다이어그램과 행위 다이어그램으로 나뉩니다. <br/>\
구조 다이어그램엔 클래스 다이어그램이 있고, 행위 다이어그램엔 Use Case 다이어그램이 있습니다.\
',

'스토리보드는 디자이너와 개발자가 최종적으로 참고하는 문서입니다. <br/>\
목업은 디자인, 사용방법설명, 평가등을 위해 실제 화면과 유사하게 만든 정적 형태의 모형입니다. <br/>\
프로토타입은 와이어프레임이나 스토리보드등에 인터렉션을 적용함으로써 실제 구현된 것 처럼 테스트가 가능한 동적인 형태의 모형입니다. <br/>\
유스케이스는 사용자 측면에서의 요구사항으로, 사용자가 원하는 모굪를 달성하기 위해 수행할 내용을 기술하는 것을 말합니다.\
',

'저의 강점과 더불어 하고싶은 업무를 생각해봤습니다. <br/>\
먼저 저는 개발자 출신에 알고리즘 분야에 강점이 있습니다. 따라서 디지털 변환처에서 각종 솔루션 사업을 경험하고 싶습니다. (전력설비 위치 찾기, 전력 빅데이터 경험) <br/>\
다음으로 저는 기술사적 사고능력을 갖고 있는 강점이 있습니다. 실무부서에서 배운 경험과 더불어 ICT 기획처에서 ICT 기획을 수행하고 싶습니다.\
',

'수소경제는 수소를 이용하여 에너지원으로 삼는 차세대 에너지 기술입니다. <br/>\
크게 탄소배출을 하는 그린 수소와 그렇지 않는 그레이 수소로 분류되는데, 한전은 그린수소 개발 및 사업 협력에 MOU를 체결한바 있습니다. \
',

'탄소중립이란 인간의 활동을 통해서 발생하는 온실가스의 양을 최대한 감소시키고, 배출된 온실가스는 흡수, 제거해 실질적 배출량이 0가 되는 개념을 말합니다. <br/>\
한국전력공사엔 이를 위해 기술적인 노력과 관리적인 노력을 수반하고 있습니다. <br/>\
먼저 기술적인 노력으론 에너지 신사업을 통해 에너지 발전의 효율화, 에너지 활용의 예측화 등이 있습니다. <br/>\
다음으로 관리적 측면입니다. 지속가능한 경영을 위한 ESG 경영을 수행하고 있고, CDP 기후변화 대응 우수기업에 5년 연속 선정된 바 있습니다.\
',

'정적 다이어그램은 구조를 나타내는 다이어그램으로 클래스, 컴포넌트, 패키지 다이어그램등이 있습니다 .<br/>\
동적 다이어그램은 행위를 나타내는 다이어그램으로 UseCase, Activity, Interaction 다이어그램등이 있습니다. <br/>\
보통 아키텍처 설계 단계에선 정적 다이어그램을, 상세 설계 단계에선 동적다이어그램을 활용하여 시각화 합니다.\
',

'클래스 설계원칙을 다른말로 SOLID 원칙이라 합니다. <br/>\
SRP, OCP, LIP, ISP, DRP 라고 하며 상세 설명으론 <br/>\
단일 책임 원칙, 개방 폐쇄 원칙, 리스코프 치환 원칙, 인터페이스 분리 원칙, 의존성 역전원칙이라 합니다. <br/><br/>\
단일 책임 원칙은 클래스가 단일 기능만 수행해야함을 말합니다. <br/>\
개방 폐쇄 원칙은 수정엔 개방 되어야 하고, 삽입 삭제에 대해선 폐쇄 되어야하는 원칙을 말합니다. <br/>\
리스코프 치환 원칙은 서브 클래스는 상위 클래스를 대신할 수 있어야 하는 원칙을 말합니다. <br/>\
인터페이스 분리 원칙은 인터페이스에도 역시 SRP가 적용되어야 함을 말합니다. <br/>\
의존성 역전원칙은 상위 계층이 하위 계층에 의존하는 전통적인 의존관계를 역전시킴으로써 상위 계층이 하위 계층의 구현으로부터 독립되게 할 수 있음을 말합니다.\
',

'경력과 자격사항을 통해 ICT직무에 확신을 갖게되었습니다. <br/>\
병원 전산실 개발자 근무 당시 제 손끝을 통해 업무 효율성 향상 성과를 눈으로 직접보니 정말 보람찼습니다. 이를 계기로 직무에 확신을 갖게되었습니다. <br/>\
나아가 기술사 수험기간중 그린 에너지와 지속가능한 경영에 눈길이 갔고, 자격과 경력을 기반으로 큰 세계로의 경험을 위한 기업을 찾던중 국내 1위 에너지 공기업인 한국전력공사에 자연스레 눈길이 갔습니다.\
',

'한국전력공사 ICT 직무분야는 크게 전력IT, 사내 시스템, 정보 보안으로 구성됩니다. <br/>\
전력 IT는 전력 LifeCycle의 각 요소요소에 IT기술이 사용되고, <br/>\
사내 시스템은 ERP등 소프트웨어를 통해 전사적 자원 관리를 수행합니다. <br/>\
마지막으로 정보보안 업무는 소중한 국민의 전력 데이터를 보호하는 핵심 역할을 수행합니다. \
',

'전문성 : 정보관리 기술사 취득으로 인한 전문성을 확보할 수 있었습니다. <br/>\
역량 : 가치를 창조하는 역량을 가지고 있습니다. 기존 1인 전산실 -> 3인 규모 확장 <br/>\
현장 : ICT기술의 근간이 되는 개발업무를 수행하였습니다.\
',

'전문성이라 생각합니다. <br/>\
ICT 기술은 하루가 멀다하고 변화하는 기술분야입니다. 4차 산업혁명을 선도하기 위해선 끊임없이 변화하는 기술 트랜드를 따라가고 이를 융합할 수 있는 오케스트레이션이 가능한 통섭형 인재가 되기 위해선 전문성이 중요하다고 생각합니다.\
',

'체계화 되어있지 않은 전문성 영역이라고 생각합니다. <br/>\
사업특성상 필요에 따라, 아직 연구되지 않은 기술을 산업에 적용해야 할 때가 반드시 있을 것이라고 생각합니다. 또한, 국내 1위 에너지공기업인 만큼 이러한 도전의 기회는 많을 것이라고 생각합니다. 이 때 이 어려움을 극복하기 위해 평소에 ICT 전문가로써 사고력을 키워 이를 대비해야한다고 생각합니다.\
',

'기업가형 인재입니다. 기업가형 인재의 핵심은 바로 개인보다 회사를 먼저 생각하는 사람입니다. <br/>\
한국전력공사 근무의 핵심은 바로 순환식 근무와 지역 근무가 있습니다. 저는 지난 7년간 경력동안 한 사무실과 한 일만 줄 곳 해왔습니다. 이직을 결심한 이유중 하나는 바로 끊임없이 변화하는 환경속에서 발전하고 싶은 니즈가 있었습니다. 이런 제 자신의 생각은 한국전력공사의 걱정을 덜어주는 기업가형 인재상이라고 생각합니다.\
',

'PaaS-TA 교육을 통해서 와닿지 않았던 Platform As a Service를 체험할 수 있는 소중한 기회가 됐습니다. 이는 Legacy 기반의 On-premise 환경을 탈피하고 있는 현 상황에 대처하기 위한 기본 지식이 되리라 생각됩니다.\
',

'해당 교육을 통해선 Python을 이용하여 AI의 기초, Bigdata 시각화의 기초를 배울 수 있었고, 클라우드 환경중 가장 보편적인 AWS 환경에서 Sagemaker를 기반으로 이를 실습 해 볼 수 있는 것이 매력적이었습니다. 이를 기반으로 AI, Bigdata, Cloud 각 요소의 대세 기술들을 접함으로써 관련분야에 기초를 다질 수 있었습니다. 이는 향후 진행되는 프로젝트를 이해하는데 큰 도움이 될 것입니다.\
',

'정보관리 기술사 시험을 준비하면서 보다 넓은 지식의 세계를 간접 경험했습니다. 기술사 시험은 100점 만점중 60점이 합격점입니다. 나머지 40점을 책에선 볼 수 없었던 4차 산업현장을 경험할 수 있는 한국전력공사에서 채우기 위해 이직을 결심하게 됐습니다. <br/>\
또한 저는 ICT 기술 기반 디지털 에너지 전문가가 되고 싶습니다.\
',

'한전의 인재상에 가장 부합하신 분들은 바로 배치받을 부서의 선배님들이라 생각합니다. 그간 선배님들께서 걸어오신 길들을 보고 배워 저 또한 훗날 후배들의 모범이 되도록 노력하겠습니다.\
',

'네 저는 지난 7년간 의료 분야 IT길만 줄곧 걸어왔습니다. 하지만 도메인만 다를뿐, ICT 직무에 필요한 그 기초는 대동소이하다고 생각합니다. 제가 경력기간동안 쌓은 개발, 보안, 네트워크 설비, 개인정보 보호 등 업무는 한국전력공사 ICT 직무 분야에서 또한 동일하게 기본기로 작용할 것이라고 생각합니다.\
',

'한국전력공사에 대한 이미지는 바로 국가를 위해 헌신하는 이미지로 다가왔습니다. 현재 코로나19 이슈와 에너지 원가 급등으로 인해 전기요금의 즉각적인 인상이 필요하지만, 국민의 삶에 직접적인 영향을 주는 Social Position으로 인해 단순한 시장 논리에서 벗어나 범 국가적인 헌신과 봉사 정신으로 똘똘 뭉친 기업이라고 생각했습니다. <br/>\
개선점은 현재 중대재해법으로 인해 사업주의 안전에 대한 더욱 강화된 인식을 요구하고 있는 상황입니다. 이를 위해 ICT 기반의 안전한 산업 현장관리를 통해 한국 전력공사 직원의 소중한 생명과 국민의 생명줄 같은 전기를 지키는 회사로 발돋움 해야하는 것이 직면한 개선과제라고 생각합니다.\
',

'한국전력에 입사한다면 디지털 에너지, 정보 보안, ERP 등 ICT 개발,프로젝트를 중심으로 경험을 쌓고 훗날 한국전력의 ICT 기획 및 ISP 수립을 하는 직무를 수행하고 싶습니다.\
',

'조직을 좀 더 다채롭게 이해할 수 있는 훈련의 기간으로 생각하며 기꺼이 일 하겠습니다. 많은 사람들이 피한 곳이라면 그곳에선 남들과 다른 경험을 하며 성장할 수 있는 기회라고 생각합니다.\
',

'부정적인 이슈라 함은 국제 정세에 따른 에너지 원가 비용 증가로 인한 한전의 사상 최대의 적자 경영현황이 존재합니다. 보도된 자료에 의하면 2022년 1분기 5조원을 기록했다고 합니다. 이대로 유지된다면 연 적자 20조원을 기록하게 됩니다. 이를 위해 문재인 정부에서 2022년 상반기 연료비 원가제를 반영하고자 하였으나, 집권여당이 바뀌면서 재논의가 필요한 시점인 상황입니다. 개인적인 견해를 말씀드리자면, 한전의 적자는 결국 국민의 혈세로 메꿔야하므로 적절한 국민적 공감을 기반으로 점진적 전기요금 인상이 필요하다고 생각합니다.\
',

'조직 측면과 개인 측면으로 나누어 말씀드리겠습니다. <br/>\
먼저 조직 측면입니다. 조직 구조를 청렴을 실현할 수 있는 구조로 개편하여 공공기관의 신뢰도를 높이는 방법이 있습니다. 이를 위해 한국전력공사에선 ESG 경영을 통해 지속가능한 경영에 대한 신뢰도를 상승시키고 있는 현황입니다. <br/>\
다음으로 개인 측면입니다. 개개인의 노력이 없다면 조직의 목표는 흐릿해진다고 생각합니다. 따라서 회사에 대한 주인의식을 갖고 내 행동행동 하나가 한국전력공사의 얼굴이다 라고 생각하고 행동하는 자세가 필요하다고 생각합니다.\
',

'본격적으로 탄소중립에 대해 관심을 갖게된 것은 바로 기술사 시험공부를 하면서 입니다. 지난해 7월 한국판 뉴딜 2.0이 발표되면서 자연스레 탄소중립에 대한 학습을 하였고, 지속가능한 경영에 대한 국가적인 노력이 필요하다고 생각하게 됐습니다. 더불어 자연 다큐멘터리를 보고 이에 대한 공감이 더해졌습니다. 이에 대해 제가 지원한 ICT 기술 분야의 기초를 경력과 자격을 기반으로 다졌고, ICT 기반 디지털 에너지 전문가가 되어 탄소중립의 현장의 중역이 되는 것이 제 계획입니다.\
',

'비슷한 사례로 병원 전산실 근무 당시 건물간 네트워크 포설 공사가 예정되어 있었습니다. 제가 그분들의 안전을 직접적으로 도와드릴 순 없었지만, 사전 업무 조율을 통한 업무 시간 단축과 업무 시작전 따뜻한 차 한잔의 여유를 함께 가지며 성공적으로 포설 공사를 마친 경험이 있습니다. 이처럼 사업주의 안전에 대한 책임이 강화되고 있는 지금, 직,간접적으로 전 직원의 마음이 하나 되어 이에 동참하려는 마음가짐을 갖는 것이 중요하다고 생각합니다.\
',

'물론 경우에 따라 다르겠지만, 한 사람의 실수에 대한 책임을 개인에만 묻기전에 이를 허용할만한 조직적인 허점이 있었는지를 파악하고 재발방지책이 중요하다고 생각합니다. \
',

'전기료 인상에 대한 이유와 근거, 그리고 인상에 따른 효과를 국민 공감대에 맞춰 광고해야한다고 생각합니다. 코로나 19 이슈, 무역 분쟁, 우크라이나 전쟁등 국민들의 지갑 사정을 어렵게하는 국제 정세지만, 위 부분은 반드시 공감 가능한 영역이라고 생각합니다.\
',

'단연 정보관리 기술사 수험생활이 가장 힘들었습니다. 직장을 다니면서 시간을 아껴가며 공부하고, 길고 어두운 터널을 지나는것만 같았습니다. 하지만, 이 기간중 과정속에서 즐기는 법을 배우게 됐고 이는 앞으로의 제 삶에 귀한 양분이 될 것으로 생각됩니다.\
',

'개발 경력중 생긴 저의 가치관이 있습니다. 바로 모든 일의 첫단추는 바로 소통이다.는 것입니다. 요구사항 수집시 서로의 업역이 달라 이해하는 정도의 차이로 인해 요구사항 수집이 어려운 경험이 있었습니다. 이를 극복하기 위해 무슨일을 하던지간에 소통에 대한 노력을 더욱 기울였고, 그 결과 보다 나은 성과를 얻을 수 있었습니다. 이러한 상대적으로 긴 조직생활에 대한 경험은 신입사원으로 입사하여 보다 나은 조직의 가치를 이끌 수 있을것이라 생각됩니다.\
',

'근무기간중 부당한 지시를 받아 매우 당황한 경험이 있습니다. 하지만 부당하다고 생각이 들더라도 먼저 이를 따르고 그 결과에 대한 해석을 차분히 해보았습니다. 마음을 가라앉히고 넓은 관점으로 생각해보니 제게 부당하다고 느껴졌던 것들이 상사 입장에선 필요한 지시사항이었다는 것을 깨닫게 됐습니다. <br/><br/>\
이외 상식선을 벗어나거나 법적 문제 소지가 있을만한 부당한 지시가 내려질 경우, 원만한 관계를 유지하며 최대한 대화로 해결해보려는 노력을 가진 이후, 서면이나 상급자 보고 등을 활용하여 문제 해결과 관계유지 두마리 토끼를 최대한 잡아보겠습니다.\
',

'보통 공감대를 형성할 수 있는 동료들과 함께 차 한잔 하며 대화로 스트레스를 푸는 편입니다. 스트레스는 고민을 공유하고 나누고 동기애를 통해 더욱 돈독해지는 계기가 되는 것 같습니다. \
',

'큰 결정은 신중하게 내리고 파생되는 작은 결정들은 다소 과감하게 내리는 편입니다. 우선 결정에 필요한 요소는 바로 성장에 대한 고민과 불편에 대한 고민으로 나뉩니다. 보통 크게보는 거시적 관점에선 성장에 대한 고민이, 미시적 관점에선 불편에 대한 고민이 들기 시작하기 때문에, 먼저 성장에 대한 관점을 신중하게 생각하고, 나머지 파생되는 곁가지 문제점들은 다소 과감하게 감내하거나 극복하려고 하는 마음가짐을 갖는 편입니다.\
',

'수익이 없이는 공공에 대한 기여 또한 없다고 생각하기에, 수익성이 더 중요하다고 생각합니다. 한국전력공사는 여러 에너지 원료를 통해 전기를 생산해내고 국민들에게 이를 안정적으로 공급하는 기업입니다. 따라서 공공성 또한 중요하지만 자사의 수익성이 보장되어야 미래지향적, 지속가능한 경영이 가능하다고 생각합니다.\
',

'우선 상사와의 갈등은 마냥 부정적이라 보지 않습니다. 이는 서로 다른 두 사람이 협업하기 위한 성장통이라 생각합니다. 결국 이 갈등을 통증에서만 끝낼 것이 아닌 당장의 통증은 있지만 성장으로 이끌어내야 함이 중요하다고 생각합니다. 이를 위해서 경청과 대화 그리고 희생을 통해 원만한 관계를 이어갈 수 있도록 노력하겠습니다. \
',

'병원 전산실 근무 당시 전산 담당 의사와 업무 이해도차이로 인해 갈등이 있었습니다. 주된 갈등 내용은 전산 담당 의사 선생님께선 업무의 효율성을 강조하셨고, 개발자인 저는 개발 가능성에 대해 주목을 했습니다. 대화를 통해 저는 업무의 효율성을 이해했고, 전산 담당 의사 선생님께선 개발 요청별 개발 업무 난이도와 현실 가능성에 대해 이해하게 됐습니다. 이러한 생각 차이가 줄어들때 즈음, 서로 말하지 않아도 통하는 면이 생기는 팀워크가 생겼습니다.\
',

'저는 리더십쪽이 큰 편입니다. 그동안의 크고 작은 조직에서 리더를 도맡아하는 성격이기도 했고, 실제로 주어진 일이 맡겨질땐 체계적으로 구성원에게 역할분담을 하는 능력이 타고난 면이 있다 느껴, 리더십쪽이 더 크다고 생각합니다. 또한 리더십을 통해 다져진 리더가 좋아하는 행동을 알기 때문에 팔로워가 되는 상황에서 또한 주어진 역할에 충실할 수 있습니다.\
',

'훌륭한 팔로워를 맘편히 일할 수 있게 해주는 능력이라고 생각합니다. 보통 리더가 되면 훌륭한 팔로워에게 더 많은 업무를 할당하거나 의지하게 됩니다. 하지만 이는 훌륭한 팔로워를 금새 지치게 하는 악수로 작용합니다. 따라서 훌륭한 리더십은 각자 구성원들이 성과에 따른 적절한 보상을 받을 수 있게 끌고 가는 능력이라고 생각합니다.\
',

'저의 장점은 크게 경력, 자격 그리고 능력상 장점이 있습니다. <br/>\
먼저 경력상 장점입니다. 저는 한 기관에서 7년 동안 우직하게 근무한 경력이 있습니다. 이는 향후 한국 전력공사에 입사해서 크고 작은 변수가 생기더라도 감내할 수 있음을 의미합니다. <br/>\
다음으로 자격상 장점입니다. 저는 정보관리 기술사 자격을 갖고 있습니다. 수험기간 중 배운 기술사적 사고력은 업무를 버드뷰로 바라볼 수 있음을 의미합니다. <br/>\
마지막으로 능력상 관점입니다. 모든 ICT업무의 원리를 이해하기 위해선 개발 업무의 기초지식이 필요합니다. 개발자로 근무한 기간이 있기에, 기초지식이 탄탄한 지원자임을 의미합니다.\
',

'저의 성격상 장점은 타고난 의사소통 능력입니다. <br/>\
처음 보는 사람과도 쉽게 친해질 수 있는 친화력과 의사소통 능력을 갖고 있습니다. 이는 지난 7년간 근무한 직장에서도 빛을 발한 저의 소중한 장점이라고 생각합니다. 한국전력공사에서 또한 이 장점은 업무 적응을 돕고 유연하고 원만한 인간관계 기반으로 업무할 수 있으리라 생각됩니다.\
',

'저의 단점은 반복되는 업무에 염증을 낸다는 것입니다. 이를 해결하기 위해 전산실 근무 당시 Window Batch File, Linux Shell Script등을 활용하여 자동화 할 수 있는 것은 최대한 자동화하는 노력을 기울였습니다.\
',

'우선 저와 맞지 않는 상사를 7년동안 모신 경력이 있습니다. 이 경험을 기반으로 말씀 드리겠습니다. 우선 저와 맞지 않는 유형은 바로 프로그램 개발을 쉽게 보는 경향이 있는 성향을 가진 유형입니다. 물론 업무의 효율성과 전사적 이익을 위해 마땅히 해야할 노력으로 해석하실수도 있지만, 기술 부서의 상황과 구현 가능성이 존재하기 때문에 개발자 입장에선 마냥 백지수표를 남발할 순 없는 노릇이었습니다. 이를 해결하기 위해 기술에 대한 공감을 위해 비유를 통해 최대한 쉽게 설명하려는 노력을 기울였으며, 필요시 가시화된 자료를 설명해드리며 이해를 도왔습니다. 이러한 노력을 통해 마냥 거절하는 아랫직원이 아닌 충분히 알아보는 노력을 기울이는 직원으로 인식시켜드렸고, 이후 신뢰를 기반으로 꽤 긴 기간동안 호흡을 맞출 수 있었습니다.\
',

'팀 내부적으로 결정에 필요한 주요 가치관 우선순위를 정하고 그 우선순위에 따라 의견 반영을 하겠습니다. 만약 팀 내부적으로 결정이 좀처럼 이루워지지 않는다면, 동일 레벨의 부서 혹은 상급 부서에 자문을 구하는 절차로 문제를 해결하겠습니다.\
',

'생소했던 의료 도메인에 적응했던 경험을 바탕으로 말씀드리겠습니다. <br/>\
먼저 현장을 들여다 볼 것입니다. 백문이 불여일견이기 때문에 먼저 현장을 보면 다음 업무에 대한 이해도가 높아짐을 느꼈습니다. <br/>\
다음으로 직속 상사의 업무를 들여다 볼 것입니다. 직속 상사의 일이 다음 제게 맡겨질 가능성이 가장 높기 때문에 이에 집중하겠습니다. <br/>\
메뉴얼에 집중하겠습니다. 업무상 작성된 메뉴얼, 공문 그리고 계획표등 열람 가능한 자료에 대해 최대한 집중을 기울여 업무에 적응하도록 하겠습니다.\
',

'같은 결과를 다르게 낼 줄 아는 능력이라고 생각합니다. <br/>\
프로그램 개발에선 소스코드를 어떻게 작성하느냐에 따라 결과는 같지만 과정이 더욱 효율적으로 진행되는 사례가 있습니다. 이를 위해 기존의 소스코드를 시간과 능력이 허락하는 한에서 창의적으로 접근한 경험이 있고 이는 프로그램 메커니즘의 효율을 올리는 성과가 있었습니다. 위 경험을 바탕으로 한국전력에 입사하면 이를 적용하여 창의적인 인재가 되고자 합니다.\
',

'소프트웨어 공학과 프로그래밍 언어 과목입니다. <br/>\
소프트웨어 공학과목에서 배운 프로젝트 메커니즘은 한국전력공사에서 주어진 일에 맞게 업무를 수행할 수 있는 밑거름이 될 것입니다. <br/>\
또한 프로그래밍 언어 과목을 통해 시스템의 동작 원리의 기본에 대한 이해도는 프로젝트를 근본적으로 이해할 수 있는 기초라고 생각합니다.\
',

'저는 ICT 기술기반 디지털 에너지 전문가가 되고 싶습니다. <br/>\
이를 위해 단기적으로는 생소했던 의료 도메인에 적응한 경험을 바탕으로 새로운 도메인에 적응하겠습니다. <br/>\
장기적으로는 정보관리 기술사 자격으로 한국전력공사 ICT 직무 분야에 기여할 수 있는 부분을 찾아 지속적으로 헌신하도록 하겠습니다. <br/>\
이를 통해 2050 탄소중립 역사적인 순간순간마다 크고작은 일에 일꾼이 되도록 하겠습니다. <br/><br/>\
* 마지막 한마디 <br/>\
정보관리 기술사의 합격점수는 60점입니다. 이 점수의 의미는 이론으로 60점을 채우고, 현장에서 40점을 채우라는 의미라고 선배 기술사님께 배웠습니다. 저의 40점을 한국전력에서 채워 ICT 기술기반 디지털 에너지 전문가가 되어 2050 탄소중립 현장에서 한국전력을 빛내고 싶습니다. 감사합니다.\
',

'정보관리 기술사 취득과정이 굉장히 힘들었습니다. <br/>\
방대한 토픽양과 업무와 학습을 병행하는 것이 쉽지 않았습니다. 하지만 4차 산업의 중역이 되고자 길고 어두운 터널을 묵묵히 걸어갔고 결국 합격하여 이를 활용하기 위해 한국 전력공사에 지원하게 됐습니다. 힘든 경험을 극복한 지금, 한국전력 공사에 입사하여 뜻을 펼칠 미래를 기대하고 있습니다.\
',

'ICT 기반 디지털 에너지 전문가가 되기 위해 지원하게 됐습니다. <br/>\
기술사 학습 과정중 지속가능한 경영과 환경요소의 핵심인 그린 에너지 기술에 관심을 갖게 됐고, 국내 에너지 기술을 선도하는 한국전력공사에 자연스레 눈길이 갔습니다. <br/>\
현재 한국전력은 2050 탄소 중립을 위해 중장기 정보화 전략 계획등을 수립하고 있습니다. 위 역사적인 순간순간마다 크고작은일에 일꾼이 되기 위해 한국전력공사에 지원하게 됐습니다.\
',

'지금 당장은 에너지 효율이 좀처럼 나지 않아, 손실일 순 있겠지만, 지속가능 경영 관점으로 볼땐 이익이라고 생각합니다.\
',

'지속 가능 경영인 ESG 관점에서 말씀드리겠습니다. <br/>\
환경 관점에선 친환경 디지털 기반 에너지 발전을 추구합니다. <br/>\
사회 관점에선 안전한 산업현장을 추구합니다. <br/>\
지배구조 관점에선 투명한 지배구조를 추구합니다.\
',

'먼저 거래자의 수 차이점입니다. 독점적 경쟁시장은 거래자의 수가 다수인 반면 과점시장은 소수입니다. <br/>\
다음 상품의 질 차이점입니다. 독점적 경쟁시장은 이질적이고, 과점 시장은 동질인 경우와 이질인 경우가 공존합니다. <br/>\
끝으로 진입장벽 차이점입니다. 독점적 경쟁 시장은 진입장벽이 낮고, 과점 시장은 진입 시장이 높습니다. <br/>\
사례 비교입니다. 독점적 경쟁 시장은 한국전력공사를 예로 들 수 있고, 과점 시장은 이동통신 시장을 예로 들 수 있습니다.\
',

'ICT 기술을 기반으로 디지털 에너지를 선도하는 것이 세계적으로 한국전력의 위상을 높이는 핵심이라고 생각합니다.\
',

'긍정적인 이미지는 탄소중립 핵심 기업, 많은 취업준비생이 꿈꾸는 공기업 그리고 해외 사업지를 둔 글로벌 공기업입니다. <br/>\
부정적인 이미지는 현재 적자를 기록하고 있는 현실, 그리고 공기업중 산업 재해가 가장 많은 공기업이라는 점을 들 수 있습니다. <br/>\
적자를 극복하기 위해 연료비 연동 요금제, 그리고 올해 신설된 중대재해방지법 준수 등을 통해 부정적인 사항을 충분히 극복할 수 있을 것이라 생각합니다.\
',

'세계적인 탄소 중립을 선도하는 에너지 기업이 되고 싶습니다. <br/>\
현재 탄소 중립은 전세계적인 이슈입니다. ICT 기술을 기반으로 에너지 공기업의 defacto가 되도록 사업 계획을 편성하고 싶습니다.\
',

'먼저 경력 측면입니다. 차별화된 경력으로 인해 부서에 조속히 스며들어 가치 창출에 기여할 수 있을 것이라 생각합니다. <br/>\
다음으로 자격 측면입니다. 기술사적 사고능력을 바탕으로 버드뷰 관점의 사업 이해도가 남다를 것이라 생각합니다. <br/>\
마지막으로 기술 측면입니다. 개발 경력을 기반으로 하여 ICT 사업에 대한 근본적인 이해가 가능하다고 생각합니다. <br/><br/>\
* 포부 멘트 변경 <br/>\
정보관리 기술사 합격점은 60점입니다. 이 의미는 나머지 40점은 현장에서 경험으로 채우는 것이라고 배웠습니다. 저는 ICT 기반 디지털 에너지 기술 전문가가 되고 싶습니다. 한국전력에서 나머지 40점을 채워 탄소중립의 중역이 되고 싶습니다.\
',

'최근 문제 출제를 위해 최은만 교수님의 소프트웨어 공학을 읽었습니다. <br/>\
끊임없는 전공지식을 공부하며 기본기가 충실한 한국전력의 ICT 직원이 되도록 노력하겠습니다.\
',

'국내에 RE100제도를 도입하여 기업의 자발적인 재생 에너지 사용 촉진 및 국내 재생에너지 확대에 기여하기 위해 21년부터 한국전력을 주관으로 시행된 제도로, 국내 전기소비자가 재생에너지 전기를 사용하고, 재생에너지 사용 확인서를 발급받아 인증하는 제도 입니다. <br/><br/>\
* RE 100(Renewable Electricity 100%) : 사용전력을 100% 재생에너지로 조달하는 자발적 캠페인\
',

'국내 많은 대학생들의 소프트웨어 공학의 아버지인 최은만 교수님을 존경합니다. 저 또한 많은 사람들에게 어려운 ICT 기술을 쉽게 풀어 책으로 집필하고 싶은 꿈을 갖고 있습니다.\
',

'제3자간 PPA(Power Purchase Agreement)는 재생에너지 발전사업자와 전기사용자간 합의 내용을 기초로 한전이 발전사어바자와 구매 계약을, 전기 사용자와 판매계약을 각각 체결하여 재생에너지 전력을 제 3자간에 거래하는 제도입니다.\
',

'운동을 통해 스트레스를 해소합니다. 주로 새벽 수영을 즐겨 합니다. 이를 통해 생활 리듬을 아침형 인간으로 만들 수 있고, 상쾌함과 더불어 재충전을 하는 스타일입니다. 취미를 통해 업무에 더욱 활력을 불어넣어 생산성을 높이고 있습니다.\
',

'저의 취미는 악기연주와 수영입니다. <br/>\
주1 회 밴드에 속해 악기연주를 합니다. 수차례 공연과 학생 시절엔 기타를 가르치는 아르바이트 경력 또한 있습니다. <br/>\
다음으로 새벽수영입니다. 하루를 더 길게 살아보고자 시작했고 이는 제 삶의 생산성을 높이는 원동력이 됐습니다.\
',

'군대에서 비슷한 경험을 한 적이 있습니다. 각기 다른 나이지만 계급에 의해 정해진 위계질서를 경험한 것을 토대로 한국전력공사에서 또한 어렵지 않게 적응할 수 있습니다.\
',

'한전에서 안전은 무엇과도 타협할 수 없다는 정승일 사장님의 강력한 의지를 바탕으로 만들어진 환경(Environment), 보건(Health), 안전(Safety) 경영활동의 최우선 가치로 정한 경영방침을 말합니다.\
',
]