var answer = 
[
// 취업규칙 금지사항
'# 취업규칙 금지사항 (<font color = "red">명기겸금정</font>)<br/>\
- 명예훼손, 손해초래 <br/>\
- 기밀누설 <br/>\
- 겸직금지 <br/>\
- 사례,증여,향연,금전대차 행위 <br/>\
- 직무상 취득 정보, 재산상 이익 획득 \ 
',

// 휴가일수 계산공식
'# 정의 <br/>\
- 3년 이상 근속시 최초 1년을 초과하는 매 2년마다 1일 가산, 25일 한도 <br/><br/>\
<img src = "./img/KEPCODutyRule.png" style = "max-width:100%; height:auto;">\
',

// 전력사업 Main Stream
'# 전력사업 <br/>\
1. 조선시대 <br/>\
- 발명(1879) : 에디슨 백열전구 발명 <br/>\
- 국내도입(1887) : 건청궁 최초점등 <br/>\
- 한성전기(1898) : 최초 창립(1.26) / 콜브란 + 고종 <br/>\
- 한미전기(1904) : 돈 못줘서 고종이 따로 세움 <br/><br/>\
2. 일제강점기 <br/>\
- 일한와사전기,경성전기(1915) : 러일전쟁 승리한 일본이 전력 사업 장악 <br/>\
- 남선합동전기(1937) : 강원,충남이남(배전)<br/>\
- 조선전업(1943) : 경전,남전의 발전설비 분사(발전,송전) <br/>\
- 남선전기(1946) : 수도권(배전) <br/><br/>\
3. 건국이후 <br/>\
- 한국전력(1961) : 3사 통합 \
',
]