var answer = 
[
'지속 가능한 경영 강화를 위해 2030 중장기 전략의 일환의 ESG 상세 적용 전략 체계입니다. <br/>\
환경, 경제, 사회적 가치를 지향점으로 두어 <br/>\
디지털 기반 탄소 중립 실현의 환경 측면, <br/>\
산업 현장 안전 지원의 사회 측면, <br/>\
ESG 평가 대비 지배구조 측면으로 각각의 추진 전략이 내포 되어있습니다.\
',

'연료비 조정 단가란 석유, 석탄, 액화천연가스 등 전력 생산에 소요되는 연료 구입비를 반영해 전기 요금에 적용하는 항목을 말합니다. <br/>\
최근 코로나 19 이슈, 우크라이나 전쟁으로 인해 연료 구입비가 폭등하고 있지만, 서민 경제와 인플레이션을 고려하여 아직 까진 연료비 조정 단가를 동결한 상황입니다.\
',

'기후 환경요금은 기존 전력량요금에 포함되어 있는 <br/>\
깨끗하고 안전한 에너지를 위해 소요되는 기환경비용을 별도로 구분하여 <br/>\
표기,청구함으로써 해당 비용에 대한 투명성을 제고하기 위한 요금제도 입니다. <br/>\
관련 이슈론 지난 12월 기후환경요금을 4월에 올리겠다고 공표한 바 있습니다만, <br/>\
새 정부 출범으로 전기요금 백지화에 대한 공약으로 인해 재논의가 필요한 상황입니다.\
',

'전기 생산에 쓰이는 연료비 변동분을 전기요금에 주기적으로 반영하는 제도를 말합니다. <br/>\
전기요금의 원가를 결정하는 요소 중 큰 비중을 차지하는 연료 구매 비용을 반영하려는 취지로 도입됩니다. \
',

'결론부터 말씀드리자면 전기요금은 올려야 합니다. <br/>\
개인적인 생각으로 전기요금과 지난 2년간 실시해온 사회적 거리두기는 큰 맥락이 같습니다. <br/>\
국민들의 고통을 수용할 수 있는 기간을 두어 분산시키자는 맥락입니다. <br/>\
에너지 원가 상승과 기후 환경 정책등으로 요금 상승이 불가피한 가운데 현재 한전의 적자는 5조원을 넘어 올해 20조원 적자를 기록한 예측 기사를 보았습니다. <br/>\
한전의 적자는 결국 국민의 혈세로 메울수 밖에 없는 상황으로 향하기에 마냥 전기요금을 동결할 수 만은 없는 노릇이라 생각합니다. <br/>\
따라서, 전기요금의 점진적 상승에 따른 사회적 합의와 공감이 필요하다고 생각합니다.\
',

'2009년 12월 27일 한전과 아랍에미리트 원자력공사간 성사된 186억 달러 규모의 원전 프로젝트 입니다.<br/>\
계약 이후 성공적인 준공과 함께 1,2호기 건설을 추가로 허가받아 성공적으로 수행한 프로젝트 입니다.\
',

'4차 산업 혁명의 주역이 되고자 국가 기술자격 분야의 최고 자격인 정보관리 기술사에 도전하였습니다. <br/>\
다른 수험생들보다 일찍 도전한 덕분에 기술사 자격을 갖고 신입사원으로 지원하게 됐습니다. <br/>\
기술사적 사고를 겸비한 젊은 신입사원과 한국전력공사의 사업의 규모와 방향성 조합이라면, <br/>\
개인과 회사가 동반 성장하는데, 큰 도움이 되리라 생각됩니다.\
',

'Github에 Web Hosting 기능이 있습니다. Java Script를 이용하여 소스코드를 작성하고 이를 호스팅 했습니다. <br/>\
위 서비스를 활용하여 구축 비용 없이 저만의 암기장을 만들 수 있었습니다.\
',

'IaaS, PaaS, SaaS 는 클라우드 서비스 유형을 말하고, 이는 제공되는 자원의 범위에 따라 나뉩니다. <br/>\
먼저 IaaS 는 인프라를 PaaS는 개발환경을 SaaS 소프트웨어 자체를 클라우드 환경에서 제공하는 것을 말합니다. \
',

'ISP 기획은 Information Stragety Planning의 약자로 중장기 정보화 기획을 말합니다. <br/>\
이는 조직에 정보화 사업을 중장기적으로 어떻게 수행할지 청사진을 그립니다. <br/>\
전체적인 컨셉은 EA에서 그린 그림을 ISP에서 세분화 하고, 이를 ISMP를 통해 상세화 시킵니다. \
',

'기술사 취득 후 같이 학습했던 기술사님들끼리 모여 집필활동을 하고 있습니다. <br/>\
1월 말부터 시작해서, 2주에 한번 Zoom을 통해 Meeting 을 하여 현재 출판사에 기획안을 투고했고, 검토중입니다. <br/>\
책 주제는 IT 기술을 쉽게 풀어 설명해주는 컨셉의 책입니다. <br/>\
이를 통해 협업과 가치창출 그리고 전문지식에 대한 사회공헌을 하고 있다 생각들어 기쁩니다.\
',

'PaaS-TA 란 오픈 소스 기반의 클라우드 서비스 개발 환경과 통합 모니터링 환경등이 추가된 국산 개방형 클라우드 플랫폼입니다. \
',

'클라우드 개론, Virtual Machine 설치, PaaS-TA 기반 서비스 제어를 했습니다. <br/>\
가상 머신 기반의 정형화된 개발 플랫폼 설치 방법을 익힐 수 있었습니다. <br/>\
기존 가상머신에 비해 PaaS-TA 플랫폼에서 제공하는 기능들이 굉장히 직관적인게 인상깊었습니다.\
',

'전반적인 인공지능에 대한 학습, Python과 관련 라이브러리 사용법, AWS 환경 기반 구축 방법을 학습했습니다. <br/>\
인공지능에 대한 학습 과정중 기술적인 교육 이외에 인공지능 윤리와 같은 교육이 포함되어 있어 인상 깊었습니다.\
',

'Numpy, Matplotlib, Pandas는 모두 인공지능 및 빅데이터를 위한 Python Library입니다. <br/>\
Numpy는 주로 행렬이나 대규모 다차원 배열 연산을, Matplotlib는 수학적 확장 연산을, Pandas는 Bigdata 시각화를 도와주는 Library입니다.\
',

'ESS 는 Energy Storage System으로, 저장이 어렵고 사용 후 없어져버리는 에너지를 효율적으로 사용할 수 있도록 저장,관리하는 시스템입니다. <br/>\
ESS 종류론 주택용 ESS와 상업용 ESS가 있습니다.\
',

'스마트 그리드는 국가나 도, 주 단위의 광역지역을 위한 지능형 전력망을 뜻하고, (AMI, 송,배전 인프라)<br/>\
마이크로 그리드는 독립된 분산전원을 중심으로 한 국소적인 전력 공급 시스템을 말합니다. (EMS, ESS)\
',

'조직활동 중 다양한 이해관계자가 이해하는 수준이 다른 것이 다소 힘들었습니다. <br/>\
병원 전산실에서 근무할 당시, 개발자의 언어와 임상의 언어가 달라 의사소통이 힘들었습니다. <br/>\
이를 극복하기 위해 용어 사전을 정의하여 접점이 생갈만한 용어를 정리하니 훨씬 수월하게 업무에 임할 수 있었습니다. <br/><br/>\
의학용어 정리 // 정형, 비정형 데이터 정리 \
',

'병원 전산실 근무 당시 업무처리순서에 대해 C Level 과의 갈등이 있었습니다. <br/>\
갈등의 원인은 저는 전산실 입장을 고집하고, C Level분은 병원 전체를 고려한 제안이었습니다. <br/>\
',

'저의 차별화된 장점 2가지를 말씀 드리겠습니다. <br/>\
먼저 경력측면의 장점입니다. <br/>\
요즘 MZ세대는 한 직장에 오랫동안 머무르지 않아 기업 입장에서 어려움을 겪고 있다고 합니다. <br/>\
이에 반면 저는 한 직장에서 7년동안 근무한 경력이 있습니다. <br/>\
같은 MZ세대지만 장점은 겸비하고 단점은 해결이 된 인재라고 감히 말씀드리겠습니다. <br/><br/>\
다음으로 자격측면의 장점입니다. <br/>\
저는 정보관리 기술사 자격을 갖고 있습니다. <br/>\
이는 다른 면접자들에 비해 한 층 높은 기술적인 안목을 갖고 있다고 말씀드릴 수 있습니다. <br/>\
폭넓은 기술에 대한 이해와 사고능력은 업무의 적응과 더불어 사업수행에 큰 강점이라고 생각합니다.\
',

'지속가능한 기술분야의 전문가로써 성장하기 위해 지원했습니다.<br/>\
최근 전세계를 강타하는 이슈중 하나는 바로 탄소 중립이라고 생각됩니다. <br/>\
인간의 욕심으로 인해 생긴 환경적인 문제를 해결하기 위해 ICT 기술이 큰 역할을 할것이라는 기고문을 보고 감명받았습니다. <br/><br/>\
현재 한국전력의 경우 기존 에너지 기술을 넘어 디지털 에너지 기술로 나아가며, 시장을 선도하고 있습니다. <br/>\
이로 인해 생산의 효율화, 소비의 예측화 나아가 탄소중립의 현실화를 이루는<br/>\
한국전력공사가 가장 적합하다고 판단되어 입사를 결심했습니다.\
',

'저의 장점은 주어진 가치에 안주하지 않는 점입니다. <br/>\
개발자로 근무했을 당시, 표면적으로 잘 운영되는 프로그램이 있었지만, 효율적인 메모리 관리가 되지 않은 점을 문제 삼았습니다. <br/>\
메모리를 좀 더 효율적으로 관리하기 위해 소스코드를 Refactoring 자주하는 습관으로 업무에 임했습니다. <br/>\
이는 앞으로 주어질 업무에도 동일하게 적용될 것으로 생각됩니다. <br/><br/>\
단점은 반복된 업무에 쉽게 염증을 낸다는 것입니다. <br/>\
전산실 근무중 이를 해결하기 위해 자동화할 수 있는 것은 최대한 자동화를 시키기 위해 <br/>\
Window Batch File, Linux Shell Script를 학습하여 휴먼에러를 최소화 시킬 수 있었습니다. \
',

'PLC 통신은 Programmable Logic Controller 통신으로 산업의 유지 관리 및 자동제어 모니터링에 사용되는 제어장치를 위한 통신입니다.\
',

'현재 한국전력공사의 주요 사업은 국내 사업과 해외 사업 그리고 에너지 신사업으로 나눌 수 있습니다. <br/>\
먼저 국내 사업입니다. 국내 사업엔 송배전, 전력판매, 수요 관리등 주로 전력 공급에 대한 기초 사업입니다. <br/>\
다음으로 해외 사업입니다. 해외 사업엔 전력 공급에 대한 기초 사업을 해외를 대상으로 하는 사업입니다. 2009년엔 한국형 원전을 UAE로 수출하는 성과를 낸 이력이 있습니다. <br/>\
마지막으로 에너지 신사업입니다. 전기차, 태양광, 스마트시티, 그린 수소등 주로 탄소 중립을 위한 신사업이 포진되어 있습니다.\
',

'AMI란 Advanced Metering Infrastructure로 지능형 원격 검침 장치입니다. <br/>\
주요 기능은 에너지 사용량 모니터링, 인공지능을 활용한 부하 예측등이 있고, 최근엔 이를 위해 삼성전자와 MOA를 체결한 이력이 있습니다. <br/>\
또한 한전의 그룹사인 한전KDN에선 최근 효율적인 AMI관리를 위한 AMI 장애 진단 시스템을 개발한 이력이 있씁니다.\
',

'네트워크 토폴로지란 네트워크 요소들인 링크와 노드 등의 물리적, 논리적 연결을 뜻합니다. <br/>\
대표적인 토폴로지는 Star형, Bus형, Mesh형 등이 있습니다.\
',

'수요반응인 DR은 Demand Response의 약자로, 현재 전력량의 수요에 맞추기 위해 전기 사용자가 사용량을 변화시키는 것을 말합니다. <br/>\
이는 전력을 생산하는 공급측면의 기회비용이 많이 들어가, 역발상으로 공급자의 수요를 반응시키는 것을 의미합니다. <br/>\
종류론 가격 기반의 DR과 인센티브 기반의 DR 이 있습니다. <br/>\
기술요소론 인프라 측면의 AMI, Network 기술 / 서비스 측면에선 OpenADR, SEP 등과 같은 에너지 관리 시스템이 있습니다.\
',

'MOU(Memorandum of Understanding) : 교섭된 내용을 확인·확인하기 위해 정식 계약 체결에 앞서 문서로된 합의인 양해 각서 <br/>\
MOA(Memorandum of Agreement) : MOU 체결 후 이에 대한 사항을 구체적으로 명시화하여 계약한 합의 각서\
',

'Clean Energy, Smart KEPCO 입니다. <br/>\
엄정한 윤리의식을 바탕으로 깨끗하고 효율적인 에너지를 공급하며 디지털 변환을 기반으로 더 나은 에너지 세상을 구현하는 한전입니다.\
',

'TCP나 UDP에서 상호통신을 위해 미리 정해놓은 Port를 말합니다. 전체 범위는 16bit를 사용한 주소범위 이고, 이중 자주 사용하는 Port를 10bit 이내 범위로 정의 해놓은 것이 Well known port입니다. 대표적인 Port 번호는 HTTP 80 port, Telnlet 23 Port 등이 있습니다.\
',

'우선 CSMA 는 Carrier Sense Multiple Access로 동시에 네트워크를 사용할 때, 상호충돌 방지 기능입니다. <br/>\
개념 비교입니다. CSMA CA는 충돌 회피 방식이고, CSMA CD 는 매체 점유 방식입니다. <br/>\\
특징 비교 입니다. CSMA CA는 ACK 프레임을 사용하여 통신하고, CSMA CD는 Carrier Sense, Multile Access, Collision Detection을 활용합니다. <br/>\
다음으로 사례 비교입니다. CSMA CA는 주로 무선 LAN에서 사용하고, CSMA CD는 주로 유선 환경에서 사용합니다.\
',

'광케이블은 빛을 이용해 정보를 전송하는 전송매체입니다. <br/>\
장점은 외부 잡음에 강하고, 광대역이고, 보안성이 좋습니다. <br/>\
단점은 물리적인 내성이 약한점이 단점입니다.\
',

'서브넷 마스크는 네트워크 영역과 호스트 영역을 구별하기 위한 마스킹 비트입니다. <br/>\
서브네팅은 할당받은 IP 주소에 서브넷 마스크를 이용하여 새로운 대역을 생성하는 방법입니다. <br/>\
VLSM은 다양한 길이의 서브넷 마스크를 사용하는 것을 의미하며 서브네팅으로 한 번 나눈 IP를 한 번 더 쪼개는 방법입니다.\
',

'PSTN은 공중전화통신망으로, 과거로부터 사용되던 일반 공중용 아날로그 전화망을 의미합니다. <br/>\
ISDN은 정합동신통신망으로, 디지털 통신망을 이용하여 음성,문자,영상 등의 통신을 종합적으로 할 수 있도록 하는 통신서비스입니다.\
',

'TRS 는 Trunked Radio Service로, 주파수를 다수의 이용자가 공동으로 사용하는 방식을 말합니다. <br/>\
여러개 주파수 중 빈 채널을 자동으로 선택, 통화하게 되므로 연결이 쉽고 외부로부터 혼선이 없으며 통화 누설이 없어 보안성이 우수합니다.\
',

'Pulse Code Modulation으로 펄스 부호 변조입니다. 디지털 신호를 디지털 신호로 변환하는 통신 방식입니다. <br/>\
PCM 이외 펄스의 폭을 조절하는 방식으로 변조하는 PWM이 존재합니다.\
',

'ASK, PSK, FSK는 먼저, 아날로그 신호를 디지털 신호로 변조하는 기술들입니다. 이들은 반송파를 어떻게 변조하느냐에 따라 구분됩니다. <br/>\
ASK 는 진폭에 의한 변조, PSK는 위상에 의한 변조, FSK 는 주파수에 의한 변조를 나타냅니다. <br/>\
보통 잡음과 내성에 강한 FSK나 PSK를 사용합니다.\
',

'ESS는 Eneregy Storage System으로 원하는 시간에 전력을 생산하기 어려운 태양광, 풍력등 신재생 에너지를 미리 저장했다가 필요한 시간대에 사용할 수 있게 해주는 에너지 저장 시스템 기술을 말합니다. <br/>\
이는 전기를 생산하는 발전 영역, 생성하는 송배전 영역 그리고 전기를 수용하는 수용가 영역에 모두 적용되는 광범위한 기술입니다.\
',

'마이크로 그리드는 기존 전력망에 정보기술(IT)을 접목해 에너지 효율을 최적화한 차세대 지능형 전력망인 스마트 그리드를 소지역 특성에 맞게 적용한 것입니다. <br/>\
주요 기술요소론 에너지 저장 장치인 ESS와 이를 지능형 관리하기 위한 ESM이 있습니다. <br/>\
산업통상자원부의 로드맵상 전력공급이 어려운 섬 지역같은 곳들의 에너지 공급 체계를 마이크로그리드를 활용한 에너지 자립섬으로 발전시키겠다는 계획을 갖고 있씁니다.\
',

'단체의 직원만 접근이 가능한 사설망을 말합니다. 주로 폐쇄망을 사용하지만, 코로나19로 인해 재택근무 횟수가 많아진 요즘은 VPN을 활용하여 인트라넷 접근을 허용하는 기술들을 적용하고 있습니다.\
',

'크게 디지털 변전소와 한전 데이터 사이언스 연구소가 있습니다. <br/>\
디지털 변전소는 AI 기반 예측 관리 등을 통해 효율적인 변전소를 운영하는 기술입니다. <br/>\
데이터 사이언스 연구소는 한전의 기존 데이터를 기반으로 AI, DL등을 연구하는 연구소를 말합니다. <br/>\
최근 성과로는 광주광역시에서 실시한 1인가정 살핌 서비스, 딥러닝 기반 얼굴인식 기술, 태양광 발전량 예측 기술이 있습니다.\
',

'4계층 네트워크 가상화 기술입니다. 기존 전용회선을 가상화한 기술이며, 장점으론 구축비용이 저렴하다는 점이 존재하며, 단점으론 보안이 취약하다는 점입니다. 최근 코로나19와 공공기관 지역 이전으로 인해 원격지 개발, 재택근무등이 증가하면서 VPN 수요가 증가하고 있는 상황입니다.\
',

'방화벽이란 미리 정의된 보안 규칙에 기반한 네트워크 트래픽을 모니터링하고 제어하는 네트워크 보안 시스템입니다. <br/>\
구현 방법에 따라 소프트웨어 방화벽과 하드웨어 방화벽으로 구분됩니다.\
',

'패킷 별로 제어 하여 허용 혹은 거부하는 필터링 기능을 의미합니다. <br/>\
브릿지나 스위치 그리고 방화벽 단에서 기능을 제공합니다.\
',

'Programmable Logic Controller 라는 뜻으로 산업 플렌트의 유지관리 및 자동 제어 및 모니터링에 사용하는 제어 장치입니다.\
',

'푸리에 변환은 시간에 대한 함수를 주파수 섭운으로 분해하는 변환입니다. 이는 주파수 성분을 분해 함으로써 변조된 신호를 해석하는데 사용되는 기초 이론입니다. \
',

'소스코딩, 채널코딩, 라인 코딩은 모두 샤논의 통신 계통도에 정보의 부호화 복호화 과정중 필요한 개념입니다. <br/>\
먼저 소스코딩은 압축 부호화 연산이고, 채널 코딩은 데이터 에러 제어를 위해 잉여 비트를 추가하는 오류 정정 기법이고, 라인 코딩은 저장 매체에 기록 될 수 있또록 디지털 데이터를 나타내는데 사용되는 전압 또는 전류를 말합니다.\
',
]