var answer = 
[
'지속 가능한 경영 강화를 위해 2030 중장기 전략의 일환의 ESG 상세 적용 전략 체계입니다. <br/>\
환경, 경제, 사회적 가치를 지향점으로 두어 <br/>\
디지털 기반 탄소 중립 실현의 환경 측면, <br/>\
산업 현장 안전 지원의 사회 측면,
ESG 평가 대비 지배구조 측면으로 각각의 추진 전략이 내포 되어있습니다.\
',

'연료비 조정 단가란 석유, 석탄, 액화천연가스 등 전력 생산에 소요되는 연료 구입비를 반영해 전기 요금에 적용하는 항목을 말합니다. <br/>\
최근 코로나 19 이슈, 우크라이나 전쟁으로 인해 연료 구입비가 폭등하고 있지만, 서민 경제와 인플레이션을 고려하여 아직 까진 연료비 조정 단가를 동결한 상황입니다.\
',

'기후 환경요금은 기존 전력량요금에 포함되어 있는 <br/>\
깨끗하고 안전한 에너지를 위해 소요되는 기환경비용을 별도로 구분하여 <br/>\
표기,청구함으로써 해당 비용에 대한 투명성을 제고하기 위한 요금제도 입니다. <br/>\
관련 이슈론 지난 12월 기후환경요금을 4월에 올리겠다고 공표한 바 있습니다만, <br/>\
새 정부 출범으로 전기요금 백지화에 대한 공약으로 인해 재논의가 필요한 상황입니다.\
',

'전기 생산에 쓰이는 연료비 변동분을 전기요금에 주기적으로 반영하는 제도를 말합니다. <br/>\
전기요금의 원가를 결정하는 요소 중 큰 비중을 차지하는 연료 구매 비용을 반영하려는 취지로 도입됩니다. \
',

'결론부터 말씀드리자면 전기요금은 올려야 합니다. <br/>\
개인적인 생각으로 전기요금과 지난 2년간 실시해온 사회적 거리두기는 큰 맥락이 같습니다. <br/>\
국민들의 고통을 수용할 수 있는 기간을 두어 분산시키자는 맥락입니다. <br/>\
에너지 원가 상승과 기후 환경 정책등으로 요금 상승이 불가피한 가운데 현재 한전의 적자는 5조원을 넘어 올해 20조원 적자를 기록한 예측 기사를 보았습니다. <br/>\
한전의 적자는 결국 국민의 혈세로 메울수 밖에 없는 상황으로 향하기에 마냥 전기요금을 동결할 수 만은 없는 노릇이라 생각합니다. <br/>\
따라서, 전기요금의 점진적 상승에 따른 사회적 합의와 공감이 필요하다고 생각합니다.\
];