var question = question.concat(
'위치정보의 보호 및 이용등에 관한 법률',
'정보보호산업진흥법(15.12 시행)',
'ISO/IEC 27014',
'탈린 매뉴얼(Tallinn Manual)',
'ISA/IEC 62443',
'ISO/IEC 15408 ',
'코드서명 (코드사인, Codesign)',
'WPA3',
'커버로스(Kerberos)',
'동형암호',
'[동형암호]- 준 동형암호',
'[동형암호]- 완전 동형암호',
'ISMS-P',
'WAF',
'X.509',
'라이트 커맨드(Light Commands) 취약점',
'무자각 지속 인증(Implicity Continuous Authentication)',
'[암호화기술]- LEA',
'[시큐어코딩]- TouchPoints 기법',
'[개인정보보호법]- 프라이버시보호모델',
'GDPR',
'2020 정부 전자서명법 개정',
'전자서명,전자봉투',
'재현데이터, 차등정보보호',
'XSS',
'개발보안 방법론',
'Privacy By Design',
'ISO/IEC 27017',
'SDP',
'[DB 보안]- DB 보호 솔루션',
'[DB 보안][Role Based]- Bell LaPadula',
'[DB 보안][Role Based]- Biba',
'[DB 보안]- 클락-윌슨(Clack and Wilson) 모델',
);

var answer = answer.concat(
// 위치정보의 보호 및 이용등에 관한 법률
'# 정의 : 위치정보 수집하는 사업 허가제도 <br/>\
- 이동통신기술의 급속한 발달로 물류, 보안, 상거래 등에 위치정보를 이용하는 다양한 서비스가 등장하면서 개인위치정보가 유출, 남용되는 등 개인의 사생활침해 우려가 커지고 있는 바, 위치정보를 수집하는 사업에 대하여 허가제도, 위치정보기반서비스를 제공하는 사업에 대하여 신고제도를 도입하고, 위치정보의 수집·제공 등에 관한 절차를 정함으로써 사생활 침해의 방지를 도모하는 한편, 위치정보와 관련된 기술개발, 표준화등을 지원 방송통신위원회 2005.01.27 제정',

// 정보보호산업진흥법(15.12 시행)
'# 정의 : 정보보호 산업 선순환 생태계 강화 법률 <br/>\
- 정부의 정책적/법률적 지원을 통해 공기업/사기업 모두 정보보호 수요를 창출할 수 있도록 하여, 정보보호 산업 전반적으로 선순환 생태계를 강화하는 계기를 마련하기 위해 제정한 법률<br/><br/>\
# 암기 <br/>\
- 범위 : 정물융<br/>\
- 내용 : 수공 <br/>\
- 구성 : 미산이기 <br/><br/>\
# 정보보호 산업 범위 <br/>\
- 정보보안 : 클린인터넷 경제 <br/>\
- 물리보안 : 안전안심 생활 <br/>\
- 융합보안 : 안전성 강화 <br/><br/>\
# 주요내용 <br/>\
1. 수요 측면<br/>\
- 공공기관 구매 수요 정보 제공<br/>\
- 정보보호제품 및 서비스의 적정 대가 지급 노력<br/>\
- 정보보호 준비도 평가<br/>\
- 정보보호 공시제도 <br/><br/>\
2. 공급 측면 <br/>\
- 국가 및 지방자치 단체의 책무 규정 <br/>\
- 정보보호산업 진흥계획 수립 <br/>\
- 우수한 정보보호제품 공급 <br/>\
- 기술 개발 및 인력 양성 <br/>\
- 이용자 보호조치 <br/>\
- 공공기관 정보보호 조치 <br/>\
- 한국 정보보호 산업 협회 <br/>\
- 분쟁 조정 위원회 <br/><br/>\
<img src = "./img/정보보호산업진흥법.png" style = "max-width: 100%; height: auto;"><br/><br/>\
',

// ISO/IEC 27014
'# 정의 : 정보보호 거버넌스 <br/>\
- 의사결정 권한과 책임의 할당, 비즈니스와 전략적 연계, 관련 법과 규정의 준수를 위한 프로세스 및 실행체계 <br/><br/>\
- 정보보호의 전략적 방향을 제시하고 목적 달성, 적절한 위험관리, 조직 자산의 책임있는 사용, 기업 보안 프로그램의 성공과 실패가 모니터링 됨을 보장 <br/>\
- 정보의 기밀성, 무결성, 연속성을 위한 "이사회와 고위 경영진의 책임"<br/><br/>\
<img src = "./img/정보보호거버넌스_정보보호관리체계.png" style = "max-width: 100%; height: auto;"><br/><br/>\
<img src = "./img/정보보호거버넌스프로세스.png" style = "max-width: 100%; height: auto;"><br/><br/>\
<img src = "./img/기업거버넌스.png" style = "max-width: 100%; height: auto;"><br/><br/>\
# 참고사항 <br/>\
- 정보보안 3요소 : CIA(기(Confidentiality)무가) <br/>\
- 정보보안거버넌스3요소 : ISA(데세정) <br/>\
- 정보보안거버넌스목표기준 : ABC(책비준) \
',

// 탈린 매뉴얼
'# 정의 : 최초의 사이버 교전 수칙 <br/>\
- 2007년 DDoS 공격으로 탈린 지역의 인터넷이 마비된 사건을 계기로 2013년 3월 북대서양조약기구(NATO : North Atlantic Treaty Organization)가 사이버테러에 관한 조항들을 성문화한 최초의 사이버교전 수칙<br/><br/>\
# 배경 : 2007년 러시아 분산서비스거부(DDoS) 공격, 에스토니아 수도 "탈린"에서 발생한 사이버 테러 계기 <br/><br/>\
# 특징 : NATO가 공식 채택한 구속력 X 문서, 사이버 전쟁의 국제법적 룰 반영한 가이드 라인 <br/><br/>\
# 구성 <br/>\
- 국가와 사이버 공간 <br/>\
- 무력의 사용 <br/>\
- 무력충돌법 일반 <br/>\
- 적대행위 <br/>\
- 특정 사람 <br/>\
- 물자 및 활동 <br/>\
- 점령 <br/>\
- 중립\
',

// ISA/IEC 62443
'# 정의 : 범용적인 제어 시스템 보안 관련 국제 표준 규격 <br/>\
- 전사적으로 보안적인 산업용 자동화 및 제어 시스템(IACS ; Industrial Automation and Control Systems)을 구현하기 위한 일련의 표준, 보고서 및 부속 문서들을 표준하는 국제 표준 <br/>\
- IEC 62443 표준의 가이드라인을 준수한다면 네트워크에 대한 사이버 공격 위험성 낮춤 효과 <br/><br/>\
# 구성요소 (GPSC) <br/>\
- General : 개념 모델, 용어, 일반사항<br/>\
- Policies & Procedures : 보안 정책, 절차 규정<br/>\
- System : 기본적 요구사항 (FR 1~7) 설계, 구현<br/>\
- Component : 보증, 기능 요구사항 규정<br/><br/>\
# 기본 보안 요구사항 (IUSDRTR / 아유스드르트르)<br/>\
1. FR1 : Identification and Authentication Control <br/>\
- (IAC, 식별 및 인증) : 접근 허용전 모든 상요자 식별, 인증 <br/><br/>\
2. FR2 : Use Control<br/>\
- (UC, 사용 통제) : 요청된 작업 수행, 권한 모니터링 <br/><br/>\
3. FR3 : System Integrity <br/>\
- (SI, 시스템 무결성) : 인가 <br/><br/>\
4. FR4 : Data Confidentially <br/>\
- (DC, 데이터 기밀성) : 공개 방지 <br/><br/>\
5. FR5 : Restricted Data Flow <br/>\
- (RDF, 데이터 흐름 제한) : 불필요한 데이터 흐름 제한 <br/><br/>\
6. FR6 : Timely Response to Events <br/>\
- (TRE, 이벤트 적시 대응) : 적시 보안 위반 대응 <br/><br/>\
7. FR7 : Resource Availability <br/>\
- (RA, 자원 가용성) : 컴포넌트 가용성 보장 <br/><br/>\
# 보안 등급 <br/>\
- SL1 : 고의는 아니지만 허가되지 않은 액세스 보호 <br/>\
- SL2 : 해커에 의한 사이버 위협 <br/>\
- SL3,4 : 특수한 기술과 도구 방어 <br/><br/>\
* KPC 94회 2교시 3번\
',

// ISO/IEC 15408
'# 정의 : 국제 정보보안평가기준<br/>\
- Common Criteria <br/>\
- 국가마다 서로 다른 정보보호 시스템 평가기준을 연동하고 평가결과를 상호 인증하기 위해 제정된 정보보안 평가기준(국제표준 ISO/IEC15408, 1999.09. 인증) <br/><br/>\
# 암기 <br/>\
- 구성 : 1(모델)2(기)3(증)<br/>\
PP,ST,EAL <br/><br/>\
EAL : 펑스매매세세포 <br/><br/>\
- 현황 : 정인평인 <br/><br/>\
- ISO/IEC 15408 <br/>\
- ISO/IEC 18045 <br/><br/>\
# 발전 : TESEC(미국) , ITSEC(유럽), CPCPEC(캐나다) => Alignment Activity => CC <br/>\
- CC V3.1 : 중복 평가활동배제, 범위 축소, 실제 보안성에 대한 보증측면의 평가 활동을 재구성, 재조명 하는 것을 목적으로 함 <br/><br/>\
# 구성 : 모델기증 <br/>\
- Part1 (CC소개 및 일반보호 모델) <br/>\
- Part2 (보호기능요구사항) : TOE(Target Of Evaluation)기능 요구의 표준 컴포넌트 집합 <br/>\
- Part3 (보호보증요구사항) : PP,ST,EAL <br/><br/>\
- 패키지 : 부분적인 보안 목표 만족시키기 위한 컴포넌트 집합 <br/>\
- 국내 PP 사례 : 무선랜 인증 시스템 (EAL4), 통합보안관리시스템(EAL3), 안티바이러스 소프트웨어(EAL3), 국가 기관용 가상 사설망 PPV1.2(EAL3+)등 총 14종 <br/><br/>\
# EAL 상세 : 평스메메세세포 <br/>\
1) Functionally Tested : 위협, 심각X <br/>\
2) Structually Tested : 상업적 방법론 따르면 OK <br/>\
3) Mehodically Tested and Checked : 기존 개발 방법론 내 실용 보안공학 <br/>\
4) Mehodically Designed and Tested and Reviewed : 상업적 방법론 기반 실용 보안공학 <br/>\
5) Semi-formally designed and tested : 전무적 보안공학 완화 응용 <br/>\
6) Semi-formally verified design and tested : 엄격한 개발환경에서 보안공학 기법 응용 <br/>\
7) formally verified design and tested : 극도로 위험 상황, 가치가 높은 <br/><br/>\
# 국내 현황 <br/>\
- 정책기관 : 방통위 <br/>\
- 인증기관 : IT보안인증사무국(CCRA) <br/>\
- 평가기관 : KISA, KSEL, TTA, KTL <br/>\
- 인정기관 : 국가기술표준원-평가기관 자격심사 <br/><br/>\
# 참여기관 : 인정기관, 평가기관, 인증기관, 인증서보유기관, 신청기관, 사용자 <br/><br/>\
# 대상 <br/>\
- 공공기관에 납품하는 모든 정보보호시스템의 평가인증 의무화<br/>\
- 미래부 고시 공공기관용 클라우드 컴퓨팅 추가 보호조치 사항 포함 <br/><br/>\
# 절차 : 평가준비 > 평가 > 인증 > 사후조치 <br/><br/>\
# 이슈 : 개정예정 <br/>\
- 원인 : IoT등 다양 산업 분야에서 개발된 IT 제품에 대한 요증 요구 지원, 문서 중심 보증작업과 취약성에 대한 보증 이슈, 표준/실무 기술서 일관성 저하등 <br/>\
- ISO/IEC 15408 Part4 : 평가 방법과 활동의 명세를 위한 프레임워크 <br/>\
- ISO/IEC 15408 Part5 : 이미 정의된 보안 요구사항 패키지 / 추가 <br/>\
- 평가자들이 활용하는 ISO/IEC 18045dp ISO/IEC 15408 변경사항 포함 <br/><br/>\
<img src = "./img/ISOIEC15408_1.png" style = "max-width:100%; height:auto;"><br/><br/>\
<img src = "./img/ISOIEC15408_2.png" style = "max-width:100%; height:auto;">\
',

// 코드서명
'# 정의 : 디지털 도장 전자서명 방법 <br/>\
- 개발회사에서 인터넷 상으로 소프트웨어를 배포하는 경우 사용자에게 신뢰할 만한 프로그램임을 알리기 위해 소프트웨어를 인증기관에서 디지털 도장을 받도록 하는 전자서명 방법<br/><br/>\
# 절차 (생수다서배)<br/>\
1. 생성 : 프로그램을 컴파일 후 CAB 파일 생성 <br/>\
2. 수령 : .pvk, .spc 파일을 수령 (개인키와 인증키) <br/>\
3. 다운로드 : 코드사인 서명 도구 다운로드(제공업체마다 다름) <br/>\
4. 서명 : 프로그램 인증서 서명 <br/>\
5. 배포 : 프로그램을 웹서버에 올려 배포 <br/><br/>\
# 보안강화 <br/>\
- 코드서명 인증서 보안가이드 활용 <br/>\
- 점검항목 : 인증서관리, 인증서 관리시스템, 보안 업데이트 체계, 침해사고 발생시 사고 대응체게 <br/><br/>\
<img src = "./img/Codesign_1.png" style = "max-width:100%; height:auto;"><br/><br/>\
<img src = "./img/Codesign_2.png" style = "max-width:100%; height:auto;">\
',

// WPA3
'# 정의 : 차세대 Wi-Fi 보안 프로토콜 <br/>\
- Wi-Fi Protected Access <br/>\
- 강력한 인증, 고강도 암호화, 복원력 유지를 지원하는 차세대 Wi-Fi 보안 프로토콜. WPA3에서는 KRACK의 문제를 방지하기 위해, 4-way handshake를 하기전에 Simultaneous Authentication of Equals(SAE)라는 절차를 추가하고 KRACK와 같은 공격을 방지 할 수 있다',

// 커버로스
'# 정의 : 티켓 기반 NW 인증 프로토콜 <br/>\
- MIT대 Athena Project에 의해 개발된 비밀키 방식에 의한 인증 시스템으로 서비스 요구를 인증하기 위한 대칭 암호기법에 바탕을 둔 티켓 기반한 네트워크 인증 포로토콜 <br/><br/>\
# 특징 <br/>\
- 기밀성<br/>\
- 무결성<br/>\
- SPOF <br/>\
- 패스워드 추측 공격에 취약 <br/><br/>\
# 구성요소 <br/>\
- KERBEROS 서버 : 인증서버 <br/>\
- Ticket Granting Server : 티켓 발급 <br/>\
- 접속서버 : Ticket을 확인하여 티켓이 유효한 경우 접속 승인 <br/><br/>\
# Ticket의 정보내용 <br/>\
1. Client가 접속 하기를 원하는 서버의 ID <br/>\
2. Client ID <br/>\
3. Client의 Network Address <br/>\
4. Client, Server가 Service 기간 동안 공유하는 Session Key <br/><br/>\
# 활용 <br/>\
- 클라우드 스토리지 사용자 인증 <br/>\
- 네트워크 인증 시스템의 기반으로 빅데이터 환경에서의 인증 정책으로 사용됨 <br/><br/>\
<img src = "./img/Kerberos.png" style = "max-width:100%; height:auto;">\
',

// 동형암호
'# 정의 : 암호화된 상태에서 산술, 논리연산이 가능한 기술',

// [동형암호]- 준 동형암호 
'# 정의 : 수학의 준동형성 이용 암호화 함수<br/>\
- Homomorphic Encryption <br/>\
- 암호화된 데이터에 대해 복호화 하지 않고 연산을 수행할 수 있는 암호 수학의 준동형성을 이용하여 암호화 함수 중에서 평문 공간과 암호문 공간에 정의된 연산을 보존화는 암호화 함수 <br/><br/>\
# 암기 : 활용-계암공 <br/><br/>\
# 활용기법 <br/>\
- 검색 가능 계산기법 : 클라우드 이용 계산, 처리 결과 검증 <br/>\
- 검색 가능 암호기법 : 키워드 검색 기틀 포함, 인덱스 이용 <br/>\
- 암호 데이터 공유기법 <br/><br/>\
<img src = "./img/준동형암호화_1.png" style = "max-width:100%; height:auto;"><br/><br/>\
<img src = "./img/준동형암호화_2.png" style = "max-width:100%; height:auto;"><br/><br/>\
<img src = "./img/준동형암호화_3.png" style = "max-width:100%; height:auto;"><br/><br/>\
<img src = "./img/준동형암호화_4.png" style = "max-width:100%; height:auto;">\
',

// [동형암호]- 완전 동형암호 
'# 정의 : 상태 그대로 검색 가능 4세대 암호<br/>\
- Fully Homomorhpic Encryption <br/>\
- 암호화된 상태 그대로 원문 정보에 대한 연산이나 검색이 가능한 4세대 암호 (기본적인 준동형성에 모든 임의 논리 연산을 보존하는 준동형 암호) <br/><br/>\
* IBM 연구원 Craig Gentry에 의해 2009년 개발 됨 \
',

// ISMS-P 
'# 정의 : 정보보호 적합성 증명 제도 <br/>\
- Information Security Management System - Personal<br/>\
- ISMS + PIMS (18.11) <br/>\
- 정보보호 및 개인정보보호를 위한 일련의 조치와 활동이 인증기준에 적합함을 인터넷진흥원 또는 인증기관이 증명하는 제도',

// WAF
'# 정의 : 웹 공격 대응 역할 수행 장치<br/>\
- Web Application Firewall <br/>\
- 웹 방화벽(WAF)은 웹을 통한 외부의 침입이나 웹 공격을 탐지하고 대응하는 역할을 수행',

// X.509
'# 정의 : 공개키 기반 ITU-T 표준 <br/>\
- 암호학에서 공개키 인증서와 인증 알고리즘의 표준 가운데 공개키 기반(PKI)의 ITU-T 표준<br/>\
- X.509 시스템에서 CA는 X.500 규약에 따라 서로 구별되는 공개키를 가진 인증서를 발행',

// 라이트 커맨드 취약점
'# 정의 : IoT 스피커 빛 이용 원격 명령 삽입 취약점 <br/>\
- 공격자가 음성기반의 IoT 스피커에 빛(레이저)을 이용하여 원격으로 명령을 삽입할 수 있는 취약점',

// 무자각 지속 인증
'# 정의 : 행위 및 환경정보 기반 신원 인증 기술 <br/>\
- 행위 및 환경 정보를 활용하여 사용자의 명시적 개입 없이 지속적으로 신원을 검증하는 신뢰기반 인증기술 <br/><br/>\
# 절차 : 관생비결 <br/><br/>\
# 특징 <br/>\
- 보안성 : 최초 인증후 세션 탈취후에도 접근 차단 가능 <br/>\
- 명시적 미고지 : 명시적 고지 없이 모니터링 및 확인 <br/>\
- 지속적인 인증확인 : 상태정보 변경에 따라 사용자의 지속적 신원확인 시도 <br/><br/>\
# 무자각 인증 절차<br/><br/>\
<img src = "./img/무자각지속인증.png" style = "max-width:100%; height:auto;"><br/><br/>\
<img src = "./img/무자각지속인증_1.png" style = "max-width:100%; height:auto;"><br/><br/>\
1. 관찰 <br/>\
- 사용자인증 데이터 수집 : 사용자 특화된 속성으로 알려진 데이터 수집 <br/>\
- 무자각 모니터링 : 사용자와의 상호작용에서 무자각 모니터링 <br/><br/>\
2. 프로파일 생성/갱신 <br/>\
- 신규 사용자 프로파일 생성 : 새로운 사용자 프로파일 생성 <br/>\
- 기존 사용자 프로파일 갱신 : 사용자 프로파일 수집된 데이터로 검색 후 갱신 <br/><br/>\
3. 비교 <br/>\
- 패턴매칭 : 사용자 프로파일 수집된 데이터간 패턴비교 <br/>\
- 머신러닝 기반 본인여부 분석 : 머신러닝 기반으로 기존데이터의 학습 및 사용자 여부 분석 <br/><br/>\
4. 결정 <br/>\
- 인증 승인 : 알고리즘 분류 결과에 따라 승인,거부,결정 <br/>\
- 재인증 요청 : 거부 결정일 경우 재인증 요청등의 조치를 정책에 따라 수행 <br/><br/>\
# 인증 수단별 기법 및 특징 <br/>\
<img src = "./img/무자각지속인증_1.PNG" style = "max-width:100%; height:auto;">\
',

// LEA
'# 정의 : 128bit Block 암호 알고리즘 / 국가보안기술 연구소 <br/>\
- Light weight Encryption Algorithm <br/>\
- 2012년 국가보안기술 연구소 개발 128bit Block 암호 알고리즘 <br/><br/>\
# 특징 (AES 비교) <br/>\
- 속도(2.7) <br/>\
- 경량코드(1/8) <br/>\
- 효율성(1/2) 작은플랫폼 적합 <br/>\
- 암호화 Addition <br/>\
- 복호화기 Subtraction 사용 <br/><br/>\
# Spec <br/>\
1) 키 : 128/192/256 bit 가변적 <br/>\
2) 블록암호화 : 128bit <br/>\
3) 라운드 방식 : 32비트 단위 -> 라운드마다 ARX 수행 <br/>\
4) 암호화 방식 ; ARX(Addition, Rotation, XOR) 기반 GFN(Generalized Feistel Network) <br/><br/>\
# 현황 <br/>\
- 2015년 9월 룩셈부르크대 암호성능 측정 프로젝트에서 우수성 인정, 32비트 운영체제에 최적화 <br/>\
- 2015년 6월 암호모듈 검증제도 대상 알고리즘 포함 (ex. 라온 시큐어 Key # Crpyto v1.3) 알집 압축 기능 등 적용 <br/><br/>\
<img src = "./img/LEA_1.png" style = "max-width:100%; height:auto;"><br/><br/>\
<img src = "./img/LEA_2.png" style = "max-width:100%; height:auto;"><br/><br/>\
<img src = "./img/LEA_3.png" style = "max-width:100%; height:auto;">\
',

// [시큐어 코딩]- TouchPoints 기법 
'# 정의 : 보안관련 7가지 포인트 제시<br/>\
- Gary McGraw - TouchPoints 기법 <br/>\
- SW 개발시 보안과 관련된 중요 7가지 포인트를 제시하고 이를 개발 생명주기의 보안 강화 활동으로 제시 <br/><br/>\
# Point (코아침위사요운)<br/>\
- 코드검토(Code Review) <br/>\
- 아키텍처 위험분석(Archtectural risk analysis) <br/>\
- 침투테스트(Penetration testing) <br/>\
- 위험기반 보안 테스트(risk based security tests)<br/>\
- 악용사례(abuse cases)<br/>\
- 보안요구(security requirement) <br/>\
- 보안운영(security operation) <br/><br/>\
<img src = "./img/SevenTouch_1.png" style = "max-width:100%; height:auto;"><br/>\
<img src = "./img/SevenTouch_2.png" style = "max-width:100%; height:auto;">\
',

// [개인정보보호법]- 프라이버시보호모델 
'# 식별자 : 성명, 주민등록번호, 이메일 주소, 전화번호 등과 같이 그 자체로 특정 개인을 식별할 수 있는 데이터 <br/><br/>\
# 준 식별자 : 연령, 성별, 거주지역, 국적 등과 같이 해당 데이터만으로는 직접적으로 특정개인을 식별할 수 없지만 다른 정보와 결합하여 개인을 식별할 수 있는 데이터 <br/><br/>\
# 연결 공격(Linkage Attack) : 공개 데이터간의 결합으로 개인의 민감한 정보를 노출시키는 공격 <br/><br/>\
# K-익명성(K-anonymity) : 준식별자 적어도 K개 <br/>\
- 주어진 데이터 집합에서 준식별자 속성값들이 동일한 레코드가 적어도 k개 존재해야함 (준식별자 속성값은 같은 K개 값 집합 = 동질집합) <br/>\
- 동질성 공격(Homogeneity Attack) : 동질 집합 정보를 이용하여 공격 대상의 민감한 정보를 알아내는 공격 <br/>\
- 배경지식에 의한 공격(Background Knowledge attack) : 공격자의 배경 지식을 통해 공격 대상의 민감한 정보를 알아내는 공격 <br/><br/>\
# L-다양성(L-diversity) : 민감정보 적어도 L개<br/>\
- 동질 집합 정보에서 적어도 L개의 서로 다른 민감 정보를 가져야 함 <br/>\
- 쏠림 공격(Skewness attack) : 민감한 정보가 특정한 값에 쏠려 있을 경우, L-다양성 모델이 프라이버시를 보호하지 못함 <br/>\
- 유사성 공격(Similarity attack) : 익명화된 레코드의 민감한 정보가 서로 비슷하다면, L-다양성 모델을 통해 익명화된다 할지라도 프라이버시가 노출될 수 있음 <br/><br/>\
# T-근접성(T-Closeness) : 민감정보 분포 T 이하의 차이 <br/>\
- 동질 집합에서 민감한 정보의 분포와 전체 데이터 집합에서 민감한 정보의 분포가 T 이하의 차이를 보여야 하는 것 <br/>\
- 최소성 공격(Minimality Attack) : K-익명성, L-다양성 프라이버시 모델을 이해하고 있는 공격자에 의해 민감한 정보가 유출될 수 있음 <br/>\
- ε-차분프라이버시 (ε-differential privacy) : DB 레코드들에 확률적 변조를 가해 레코드 대한 식별 가능성을 제한해 민감한 정보 추측 방지<br/><br/>\
<img src = "./img/프라이버시보호모델.png" style = "max-width:100%; height:auto;">\
',
  
// GDPR
'# 정의 : EU의 일반개인정보보호 규정 <br/>\
- 1995년 EU 개인정보보호 지침 제정후 규정된 개인정보보호 법령 (2018.5.25. 시행) <br/><br/>\
# 개요 (장/전문/본문)<br/>\
- 정보보호 지령 : 1995.10.24. 7/72/34 <br/>\
- GDPR : 2016.5.27. 2018.5.25. 11/173/99 <br/><br/>\
# GDPR 주요내용 <br/>\
1. 강화 <br/>\
- 처리요건 : 자가결정권, 의사결정 거부권, 잊혀질 권리 <br/>\
- 책임 : 처리자 책임강화, 영향 평가제 <br/>\
- 벌칙 규정 : 2천만 유로, 매출액 4% <br/><br/>\
2. 완화/확대 <br/>\
- 데이터 활용 : 활용 증대, 동의 없이 사용 <br/>\
- 법 적용 영역 확대 : EU 역외 까지 <br/><br/>\
# 체계 (규원권컨3독협구특위최) <br/>\
1. 일반 규정 <br/>\
2. 원칙 <br/>\
3. 정보주체의 권리 <br/>\
4. 컨트롤러, 프로세서 <br/>\
5. 제3국 및 국제 기구로의 개인정보 이전 <br/>\
6. 독립적인 감독기구 <br/>\
7. 협력 및 일관성 <br/>\
8. 구제책, 책임, 처벌 <br/>\
9. 특정 정보처리 상황에 관한 규정 <br/>\
10. 위임 법률 및 시행 법률 <br/>\
11. 최종 규정 <br/><br/>\
* 아이리포 23회 3교시 1번<br/>\
* 117회 컴시응 4교시 1번 \
',

// 2020 전자서명법 개정
'# 공인인증서 연혁 <br/>\
1. 1999년 공인인증서 정의, 법적 효력 부여 <br/>\
2. 2006년 모든 전자 금융 거래에서 공인 인증서 사용 의무화 <br/>\
3. 2010년 스마트폰에도 공인인증서 사용 의무화 <br/>\
4. 2015년 공인인증서 사용 의무 전격 폐지 (천송이 코트 사건) <br/>\
5. 문재인 정부 국정 5개년 운영계획 : 금융,공공분야 Active X 제거 -> HTML5 해결 <br/><br/>\
# 2020 전자서명법 개정 내용 <br/>\
1. 공인인증서 제도 페지 (2, 3) <br/>\
- 공인,사설 인증서 구별 폐지 <br/>\
- 공인인증서에 우월한 법적효력 폐지 <br/><br/>\
2. 다양한 전자서명수단 이용활성화 (6)<br/>\
- 의무 부여시 법률,대통령령,국회규칙 등 상위 법령 명시 <br/><br/>\
3. 전자서명인증업무 운영사실 준수사실 안정제 도입 (7~11) <br/>\
- 합리적 선택에 필요한 정보제공 위한 운영기준 고시 <br/><br/>\
4. 전자서명 가입자 신원확인(14) <br/>\
- 대통령령이 정한 방식의 신원 확인 절차 필수 <br/><br/>\
5. 전자서명 가입자 및 이용자 보호 강화(15,20,22) <br/>\
- 전자서명인증업무준칙 작성, 게시 (서비스 종류, 요금, 이용조건, 일종의 약관) <br/><br/>\
# 사설 인증서 종류 <br/>\
1. 카카오페이 <br/>\
- PKI 구조 : 공인인증서와 동일한 구조 <br/>\
- 블록체인 기술 적용 <br/><br/>\
2. PASS <br/>\
- 통신 3사 참여 <br/>\
- 개인 휴대폰 이용 <br/><br/>\
3. 뱅크사인 <br/>\
- 은행연합회 <br/>\
- 3년 유효기간 <br/><br/>\
# 공인인증 생태계 동향 <br/>\
- EU : 고급 전자서명의 기술적 요건을 규정하고 고급 전자서명에는 법령상 요구되는 서명의 효력을, 기타 전자서명에는 당사자간 서명 효력을 부여 <br/>\
- 국내 : 혁신 금융 심사 위원회에서 SKT DID 관련 안건이 상정될 예정(2020.05.25.) \
',

// 전자서명, 전자봉투
'# 전자서명 : 서명자 확인 결합 정보<br/>\
- 서명자를 확인하고 서명자가 당해 전자문서에 서명을 하였음을 나타는데 이용하기 위해 전자 문서에 첨부되거나 논리적으로 결합된 정보<br/><br/>\
# 전자봉투 : 대칭키, 수신자 공개키 이용 비대칭 키 암호화 메시지<br/>\
- 대칭키를 사용하여 문서의 내용을 암호화한 후 해당 키를 수신자의 공개키를 이용하여 비대칭키로 다시 암호화한 암호화 메시지 <br/><br/>\
# 전자서명 생성과정 <br/><br/>\
<img src = "./img/전자서명.png" style = "max-width:100%; height:auto;"><br/><br/>\
<img src = "./img/DigitalEnvelope.jpg" style = "max-width:100%; height:auto;"><br/><br/>\
# 관련 동향 <br/>\
- 정부는 공인인증서로 인한 사용자의 불편함을 해소하기 위해 전자서명간 차별을 폐지하는 전자서명법 전부개정법률 개정안 통과 (2020.05.)\
',

// 재현데이터, 차등정보보호
'# 재현 데이터 : 통계적으로 생성한 자료 / 원자료 / 다름 / 동일 분포 <br/>\
- Synthetic Data <br/>\
- 원자료와 다르지만 원자료와 동일한 분포를 따르도록 통계적으로 생성한 자료 <br/><br/>\
# 차등정보보호 : 정보보호 구현 개념 / 입력 차이 / 출력 차이 (중대) / 자료생성 제어 <br/>\
- Differential Privacy <br/>\
- 입력에서 작은 차이가 출력에서 중대한 차이를 줄 수 있는 자료 생성 과정을 제어하여 정보보호를 구현하려는 개념 <br/><br/>\
* 라이지움 86회 1교시 3번 \
',

// XSS
'# 정의 : Web Script 게시물 기반 공격 기법 <br/>\
- 웹기반 게시판 등에 등록된 Scrpit 게시물을 조회한 사용자를 대상으로 공격하는 기법 <br/>\
- Cross-Site Scripting <br/>\
- 게시판, 웹 메일 등에 삽입된 악의적인 스크립트에 의해 페이지가 깨지거나 다른 사용자의 사용을 방해하거나 쿠키 및 기타 개인 정보를 특정 사이트로 전송시키는 공격 <br/><br/>\
# 절차 <br/>\
- 저장 : SQL Injection과 같이 사용자의 입력값에 대한 Script 검증 없이 DB에 저장 <br/>\
- 노출 : 사용자가 게시글 조회시 DB에 저장된 스크립트가 웹페이지에 노출 <br/>\
- 동작 : 브라우저에 의해 스크립트가 실행되어 동작 <br/>\
- 유출 : 사용자 PC의 쿠키정보 등의 개인정보 유출 <br/><br/>\
# 공격유형 <br/>\
1. Stored XSS <br/>\
- Persistence 방식 <br/>\
- Server Application 취약점 <br/>\
<img src = "./img/XSS_1.png" style = "max-width: 100%; height: auto;"><br/><br/>\
2. Refelective XSS <br/>\
- Non Persistence 방식 <br/>\
- Server Application 취약점 <br/>\
<img src = "./img/XSS_2.png" style = "max-width: 100%; height: auto;"><br/><br/>\
3. DOM Based <br/>\
- Document Object Model Based XSS <br/>\
- html Browser단 실행 <br/>\
- Client Browser 취약점 <br/>\
- 주기억 장치 메모리로 코드가 올라간 다음에 DOM 환경에서 악성 코드가 실행되는 형태 <br/>\
<img src = "./img/XSS_3.png" style = "max-width: 100%; height: auto;"><br/><br/>\
* 라이지움 86회 1교시 8번 <br/>\
* 그리타 \
',

// 개발보안 방법론
'# 정의 : 개발활동 적용 방법 및 프로세스 모음 <br/>\
- 신뢰성이 위협받는 상황에서도 안전한 소프트웨어를 만들기 위해 요구되는 보안 활동을 적용하는 개발방법 및 개발 프로세스의 모음 <br/><br/>\
# 필요성 <br/>\
- 전자정부 의무 사항 : 행안부고시 2018-21호 / 공공기관이 정보화사업을 추진할 경우 준수 <br/>\
- 보안 약점 사전 제거  <br/>\
- 보안 활동 표준 제공 : 구성 역할 책임 명확 <br/><br/>\
# 구성요소 <br/>\
- 요구사항 분석 : 보안 항목 식별 <br/>\
- 설계 : 위협 모델링, 보안 설계서, 보안 통제 <br/>\
- 구현 : 표준 코딩 정의서, 가이드 준수, 취약점 개선 <br/>\
- 테스트 : 모의 테스트 <br/>\
- 유지보수 : 지속적 개선, 보안 패치 <br/><br/>\
* 라이지움 86회 2교시 5번\
',

// Privacy by Design
'# 정의 : 이용자 데이터 보호 기술 및 정책 적용 <br/>\
- 서비스 기획 - 폐기 단계까지 전체 생애주기에 걸쳐 이용자의 프라이버시와 데이터를 보호하는 기술 및 정책을 적절하게 적용하는 것 <br/>\
- 이용자 프라이버시 통제권이 적절히 보호되면서도 서비스 및 시스템의 편리성을 해치지 않도록 기능을 구현 <br/><br/>\
# 7대 원칙 (사초내균전투존) <br/>\
1. 사전 예방 : 사후조치가 아닌 사전예방 <br/>\
2. 초기 설정 : 초기설정부터 프라이버시 보호조치 <br/>\
3. 내재 설계 : 프라이버시 보호를 내재한 설계 <br/>\
4. 기능 균형 : 프라이버시 보호와 사업기능의 균형 <br/>\
5. 전체 보호 : 개인정보 생애주기 전체에 대한 보호 <br/>\
6. 투명성 : 개인정보 처리과정에 대한 가시성 및 투명성 유지 <br/>\
7. 이용자 존중 : 이용자 프라이버시 존중 <br/><br/>\
# 단계별 점검 수칙 (기설점, 필준 최안투권3추종 위)<br/>\
< 기획 > <br/>\
1. 필요성 확인 : 서비스에 꼭 필요한 개인정보인지 확인 (16조 수집제한)<br/>\
2. 준수사항 확인 : 개인정보 수집시 법적 준수사항 확인 (22조 동의를 받는 방법) <br/><br/>\
< 설계 ><br/>\
3. 최소 처리 : 반드시 필요한 개인정보만 최소한으로 처리 (15조 수집/이용) <br/>\
4. 안전 조치: 개인정보 처리 단계별 적절한 안전조치 적용 (29조 안전조치 의무) <br/>\
5. 투명성 : 개인정보의 처리절차 및 방법을 투명하게 공개 (15조 수집/이용) <br/>\
6. 권리 보장 : 정보주체가 권리 행사를 쉽게 할 수 있도록 보장 (38조 권리행사 방법) <br/>\
7. 3자 제공 위탁 : 개인정보의 제3자 제공 및 위탁시 정보주체에게 명확히 안내 (17조 개인정보제공) <br/>\
8. 추가 수집 방지 : 정보주체가 서비스 해지시, 개인정보 파기 및 추가 수집 방지 (21조 개인정보의 파기)<br/>\
9. 종료 지침 : 사업 종료시 정보주체의 권리 보장 마련 (27조 이전 제한) <br/><br/>\
< 점검 ><br/>\
10. 위험요소 점검 : 서비스 출시전 개인 정보 침해 위험요소 점검 (22조 동의를 받는 방법) <br/><br/>\
# 정책 동향 <br/>\
1. EU-GDPR <br/>\
- 신기술 대응, Privacy by Design 적용 규정 <br/>\
- GDPR 제25조 <br/><br/>\
2. 미국-FTC <br/>\
- 서비스 개발 전단계 프라이버시 강조 <br/>\
- 실체적 원칙과 절차적 원칙 제시 <br/><br/>\
* KPC 94회 4교시 2번\
',

// ISO/IEC 27017
'# 정의 : 27002 기반 클라우드 서비스 정보보호 통제 가이드라인 <br/>\
- 안전한 클라우드 환경과 보안 위협의 최소화를 위해 ISO/IEC 27002 국제 표준에 기반한 클라우드 서비스 제공자와 사용자에게 적용 가능한 클라우드 서비스 정보보보호 통제 가이드라인 <br/><br/>\
# 주변 규격 <br/>\
- ISO 27001 : 조직의 정보보안 관리 요구사항 <br/>\
- ISO 27002 : 정보보안 관리 시스템 지침 <br/>\
- ISO 29100 : 개인정보 프레임워크 <br/><br/>\
# 목적 : 가이드 제공, 사용자 신뢰성 향상 <br/><br/>\
# 구성 : 정조인자 접암물운 통개공사연법 <br/>\
<img src = "./img/ISO27017.png" style = "max-width: 100%; height: auto;"><br/><br/>\
',

// SDP
'# 정의 : 클라우드 환경 네트워크 접근제어 프레임 워크 <br/>\
- Session Description Protocol <br/>\
- 어플리케이션 연결이 허용되기 이전에 사용자의 상태 및 ID를 기반으로 선인증, 후연결 방식의 신뢰적 보안연결을 제공하는 클라우드 환경의 네트워크 접근제어 프레임 워크 <br/><br/>\
# 특징 <br/>\
- Black cloud <br/>\
- 2007년 미국 정부기관 DISA에서 수행한 컴퓨터 접근 보안방식 <br/><br/>\
# 매커니즘 <br/>\
1. 인증절차 <br/>\
- 접속요청 : OAuth 접속 요청 <br/>\
- 정보전달 : SPA(Single Packet Authorization) 사용자 인증 <br/>\
- 접속허가 : Zero Trust 기반의 접근 및 통제 <br/><br/>\
2. 보안접속 <br/>\
- 보안접속 : IPSec 활용, 터널모드 방식 보안 접속 <br/>\
- 허용서비스 접속 : 인증된 사용자만 서비스 자원 할당 <br/><br/>\
# 구성요소 <br/>\
- SDP Agent : 통신(Controller), 보안접속 처리(Gateway) (PKI, SAML, OAuth)<br/>\
- SDP Controller : 통신여부 결정 (Agent, Gateway) (Zero Trust, RBAC) <br/>\
- SDP Gateway : 연결기능 제공(Controller) (IPSec, SPA(단일 패킷인증) <br/><br/>\
# VPN, SDN 비교 <br/>\
1. 개념 <br/>\
- VPN : 서로다른 양단 네트워크 사설망 기술 <br/>\
- SDP : 선인증, 후연결 방식의 N/W 경계 기술 <br/><br/>\
2. 기술요소 <br/>\
- VPN : 전송모드, 터널모드, IKE, SPD, SAD, AH, ESP <br/>\
- SDP : Agent, Controller, Gateway, IPSec <br/><br/>\
3. 방화벽 운영방식 <br/>\
- VPN : Black List, IP 기반 정적 설정 <br/>\
- SDP : White List, ID 기반 동적 설정 <br/><br/>\
* KPC 95회 1교시 2번\
',
  
// DB 보호 솔루션
'# 접근제어 시스템 <br/>\
1. Agent : DB 서버 자체 설치 (접근 제어, 로깅) <br/>\
2. Gate way <br/>\
- Proxy : 모든 IP 경유 방식 <br/>\
- In-Line : Server - Client Network 사이, 중소형 적절 <br/>\
3. Snipping : Test Access Port 장비, 미러링 통한 패킷 분석 <br/><br/>\
# DB 암호화 방식 <br/>\
1. API <br/>\
<img src = "./img/DB_Solution1.png" style = "max-width: 100%; height: auto;"><br/><br/>\
2. Plug in <br/>\
<img src = "./img/DB_Solution2.png" style = "max-width: 100%; height: auto;"><br/><br/>\
3. TDE(Transfer Data Encryption) <br/>\
<img src = "./img/DB_Solution3.png" style = "max-width: 100%; height: auto;"><br/><br/>\
4. OS 암호화 <br/>\
<img src = "./img/DB_Solution4.png" style = "max-width: 100%; height: auto;"><br/><br/>\
# 암호화 방식 비교 <br/>\
<img src = "./img/DB_Solution5.png" style = "max-width: 100%; height: auto;"><br/><br/>\
',
  
// Bell-Lapadula
'# 정의 : 기밀성 중점 모델 <br/>\
- 정보를 극비, 비밀, 미분류로 분류하여, 접근 통제하는 모델 <br/><br/>\
# 권한 <br/>\
- Read : 상 x / 하 o <br/>\
- Write : 상 o / 하 x <br/><br/>\
* 아이리포 23회 1교시 8번 \
',

// Biba
'# 정의 : Bell LaPadula + 불법 수정 방지 / 무결성 중점 모델 <br/>\
- Bell LaPadula 모델에서 불법 수정 방지 내용을 추가로 정의한 접근 통제 모델 <br/><br/>\
# 권한 <br/>\
- Read : 상 o / 하 x <br/>\
- Write : 상 x / 하 o <br/><br/>\
* 아이리포 23회 1교시 8번\
',

// Clock and Wilson
'# 정의 : 보안 접근 통제 모델 / 불법 수정 방지 / 금융, 회계 <br/>\
- 무결성 중식 상업적 모델 <br/>\
- 최초의 상업환경에 적합하게 개발된 불법 수정 방지를 위한 보안 접근 통제 모델, 금융자산의 관리, 회계등의 분야에 주로 적용 <br/><br/>\
# 정책 <br/>\
- Well-Formed Transactions <br/>\
- Separation of Duties : 임의 분리 원칙; 모든 운영과정에서 여러 사람이 각 부문별로 나누어 처리하게 하는 정책 <br/><br/>\
# 무결성 3원칙 <br/>\
- 비인가자에 의한 데이터 변형 방지 <br/>\
- 인가자에 의한 데이터의 부적절한 변형 방지 <br/>\
- 데이터 내/외부 일관성 유지 <br/><br/>\
# Access Tripe : 주체, 객체, 프로그램 <br/><br/>\
<img src = "./img/CW_Model.png" style = "max-width:100%; height:auto;">\
',
);
